wlbxcj/STM32P10/3911版/src/driver/dll/dll.c

#include "vosapi.h"
#include "dll.h"
#include "FlashOperate.h"
//#include "base.h"
//#include "GetFont.h"
#include "..\..\inc\FunctionList.h"

#include <time.h>
#include "stm32f10x_lib.h"
#include "Toolkit.h"
#include "smartcard.h"

#include "misc.h"

#include "..\lcd\lcd.h"
#include "base.h"

//size
#define FIRST_RUN_M   0     //16
#define MAN_APP_KEY_M 16    //32*2+4
#define SYSPARA_M     84    //76+4+10 -> 84+4+10
#define LCD_GRAY_M    182   //2 174->174+8 size:2
//#define DOWNLOAD_OK_M    166   //10

#define  PICC_SETPARA 184

#define STORAGE_WORD_COUNT 16

#define TMSTAG_VOS 0x01


#define DES Lib_DES
int  g_iVosFirstRunFlag;  // 1:first run, 0:not first run
int g_iActionLimits = 0;

extern unsigned char _glbPiccSetPara;
extern unsigned long LCDValue;

int TmsTag_Read(uchar type, char *tag_str)	
{
  char sTmp[20]={0},sLocDate[20]={0},i;
  char sLocMon[12][4]=
  {
    "Jan","Feb","Mar","Apr","May","Jun",
    "Jul","Aug","Sep","Oct","Nov","Dec",
  };
  
  sprintf(sTmp,"%s",__DATE__);
  //test
  //trace_debug_printf("date[%s]\n",sTmp);
  memcpy(sLocDate,&sTmp[9],2);
  for(i=0;i<12;i++)
  {
    if(memcmp(sLocMon[i],sTmp,3)==0)
      break;
  }
  sprintf(&sLocDate[2],"%02d",i+1);
  memcpy(&sLocDate[4],&sTmp[4],2);
  if(sLocDate[4]==' ')
    sLocDate[4] = '0';
  
  if(tag_str == NULL)
    return -1;
  
  switch (type) 
  {
		
    case TMSTAG_VOS:
#ifdef V10X  
      if(LCDValue < 3000)
	sprintf(tag_str, "V10X2C0%s%s",   //13/10/23
			//FIRMWARE_MAJOR_VERSION, 
			//FIRMWARE_MINOR_VERSION, 
			sLocDate, //YYMMDD
			//"130628", //YYMMDD
			"00"); //Fw_Version
       else if(LCDValue >= 3000) 
        sprintf(tag_str, "V10X1C0%s%s",   //13/10/23
			//FIRMWARE_MAJOR_VERSION, 
			//FIRMWARE_MINOR_VERSION, 
			sLocDate, //YYMMDD
			//"130628", //YYMMDD
			"00"); //Fw_Version
#else
    if(LCDValue < 3000)
	    sprintf(tag_str, "V10P2C0%s%s",   //13/10/23
			//FIRMWARE_MAJOR_VERSION, 
			//FIRMWARE_MINOR_VERSION, 
			sLocDate, //YYMMDD
			//"130628", //YYMMDD
			"00"); //Fw_Version  
    else if(LCDValue >= 3000) 
        sprintf(tag_str, "V10P1C0%s%s",   //13/10/23
			//FIRMWARE_MAJOR_VERSION, 
			//FIRMWARE_MINOR_VERSION, 
			sLocDate, //YYMMDD
			//"130628", //YYMMDD
			"00"); //Fw_Version   
#endif
			break;
    default:	
	return -2;	
  }
	
  return 0;  
}



int  sys_flash_syspara_read(u32 Address,u8 * buff,u32 len)
{
    return sys_flash_read_operate(SysEndAddr-SysStartAddr-200+1+Address,buff,len);
}

int sys_flash_syspara_write(u32 Address,u8 * buff,u32 len)
{
    return sys_flash_write_operate(SysEndAddr-SysStartAddr-200+1+Address, buff,len); 
}

/*****************************************************
功能:  核查VOS是否第一次运行
           : 返回1;第一次运行VOS
                 0;不是第一次运行VOS
******************************************************/
int  CheckVosIsFirstRun(void)
{
    BYTE FirstFlag[64];
    int i, j;
#if 0
    CheckFlash();

    s_UartPrint(COM_DEBUG,"FS=%x BT=%x\r\n",FlashType_Size,FlashType_BT);
#endif
    // change by Ryan 20080919
    memset(FirstFlag, 0, sizeof(FirstFlag));
    j = 0;
    sys_flash_syspara_read(FIRST_RUN_M,FirstFlag,16);
    
    for (i=0; i<16; i++)
    {
      
#if 0      
		FirstFlag[i] = *(BYTE*)(0xd03c0000+i); 
        //FirstFlag[i] = *(BYTE*)(0xD0000000+i);
#endif                
        if (FirstFlag[i] == 0x55)
            j++;
    }
    if (j < 10)
    {
        memset(FirstFlag, 0x55, 16);
        //(void)SectorErase(0);
        //j = s_FlashWrite(0x000000, FirstFlag, 16);
#if 0        
        s_EraseSector(0xd03c0000);
        j = s_WriteFlash((WORD*)0xd03c0000, FirstFlag,16);  
#endif
        j = sys_flash_syspara_write(FIRST_RUN_M,FirstFlag,16);
        
        if (0 != j)
            {
#ifdef UARTPRINF_DEBUG  
            Lib_Lcdprintf("Write flash error");
            Lib_KbGetCh();
#endif            
            }
        
        
        return 1;
    }
    
    
    return 0;
}

void AM_InitAll(void)
{
#if 0
    s_EraseSector(MA_SECTOR_TWO_ADDR);
    s_EraseSector(MA_SECTOR_ONE_ADDR);
#endif    
}

/************************************************************
 针对第一次运行VOS时，须初始化
 ************************************************************/
int s_InitVos(void)
{
    int iRet;
	BYTE buf[8];
	DWORD temp[2];
	DWORD dwCount;
//test
        unsigned char MMK[24];
        unsigned char ELRCK[16];
        unsigned char i;
        
	memset(buf,0xff,sizeof(buf));
	ByteToDword(&buf[0],4,&temp[0]);
	ByteToDword(&buf[4],4,&temp[1]);
        g_iVosFirstRunFlag = CheckVosIsFirstRun();
        
        //test 13/07/12
        trace_debug_printf("g_iVosFirstRunFlag[%d]\n",g_iVosFirstRunFlag);
        //1-first time run
        //0-not first time run
        if (0 != g_iVosFirstRunFlag)
        {
          
	    s_PciWritePinCount(0,temp[0]);
	    s_PciWritePinCount(1,temp[1]);
        //(void)s_RecreateSysKeyFile();
          /*
          //13/06/25
          if(g_iVosFirstRunFlag!=0)
          {
#ifdef UARTPRINF_DEBUG
            Lib_LcdCls();
            Lib_LcdPrintxy(0,0,1," DelAllSecrecyData");
            Lib_KbGetCh();
#endif            
          }
          */
            
	    s_DelAllSecrecyData();
            
            AM_InitAll();
        }

    iRet = s_PciMMKCheck();
    
        //test 13/07/12
        trace_debug_printf("s_PciMMKCheck[%d]\n",iRet);
    
    if (0!=iRet)
    {
        //(void)SectorErase(0);
        //(void)s_RecreateSysKeyFile();
        //test 13/07/12
        trace_debug_printf("g_iVosFirstRunFlag[%d]\n",g_iVosFirstRunFlag);
      
        //13/06/25
        //1-first time run
        //0-not first time run
        if(g_iVosFirstRunFlag==0)
        {
#ifdef UARTPRINF_DEBUG
          Lib_LcdCls();
          Lib_LcdPrintxy(0,0,1," MMK FAIL ");
        //test 13/07/12
        trace_debug_printf("MMK FAIL\n");
          
          Lib_KbGetCh();
#endif          
        }
        
	s_DelAllSecrecyData();
        AM_InitAll();
        s_PciInitMMK();
        g_iVosFirstRunFlag = 1;
    }
#if 0    
    //test 13/06/25
    s_PciReadMMK(0, (DWORD*)MMK);
    s_PciReadMMK(1, (DWORD*)ELRCK);
    trace_debug_printf("MMK:");
        for(i=0;i<24;i++)
          trace_debug_printf("%02x ",MMK[i]);
        trace_debug_printf("\n");
    trace_debug_printf("ELRCK:");
        for(i=0;i<16;i++)
          trace_debug_printf("%02x ",ELRCK[i]);
        trace_debug_printf("\n");
#endif    
    
