wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
    return 0;
}

int TAMPERClear(void)
{
	DWORD temp[2];
	BYTE buf[8],i;
        
  	memset(buf,0xff,sizeof(buf));
	ByteToDword(&buf[0],4,&temp[0]);
	ByteToDword(&buf[4],4,&temp[1]);

	s_PciWritePinCount(0,temp[0]);
	s_PciWritePinCount(1,temp[1]);
        //(void)s_RecreateSysKeyFile();
        
	s_DelAllSecrecyData();
        AM_InitAll();
        
        //13/05/24
        temp[0] = 0;
        for(i=0;i<STORAGE_WORD_COUNT;i++)
          ss_BpkWriteReg(i,temp[0]);
  
}


int s_CheckSDRAM(void)
{
    //int i;
	//unsigned char ch;
	//for(i=0;i<(8*1024*1024);i++)
	//{
	//	*(unsigned char *)(0x20800000+i)=0x55;
	//	ch=*(unsigned char *)(0x20800000+i);
	//	if(ch!=0x55) return -1;
	//} 
    return 0;
}

int s_CheckAllKeys(void)
{

    return 0; 
}



int s_SystemTestSelf(void)
{
    //return 0;
    int iret;
    Lib_LcdCls();
    Lib_LcdSetFont(8, 16, 0);
    Lib_LcdPrintxy(0,0,0x80,"   SYSTEM SELF TEST  ");
    //Lib_LcdPrintxy(0,16/2,1,"Test SDRAM.... ");
	Lib_LcdPrintxy(0,8*1,0,"Test SDRAM.... ");
    //test sdram
    iret=s_CheckSDRAM();
    if(iret)
    {
	s_PciInitMMK();
        //s_PciInitBPK();
        //s_PciClearAllKeys();
        Lib_LcdCls();
        Lib_LcdPrintxy(0,0,1," SDRAM FAIL ");
        //Lib_LcdPrintxy(0,16/2,1," PINPAD LOCKED ");
	Lib_LcdPrintxy(0,8*2,1," PINPAD LOCKED ");
	WriteLog("Test SDRAM FAILED\n", 1, 0xff);
        for(;;);
    }
    Lib_DelayMs(300);
    //Lib_LcdPrintxy(0,16/2,0x01,"Test SDRAM....OK");
    Lib_LcdPrintxy(0,8*1,0x00,"Test SDRAM....OK");
    WriteLog("Test SDRAM OK\n", 1, 0xff);
	

  /*  Lib_LcdPrintxy(0,32/2,1,"Test MMK....     ");*/
    Lib_LcdPrintxy(0,8*2,0,"Test MMK....     ");
    //test bpk
    iret = s_PciMMKCheck();
    if (0 != iret)
    {
	s_PciInitMMK();
        Lib_LcdCls();
        Lib_LcdPrintxy(0,0,1," MMK FAIL ");
        Lib_LcdPrintxy(0,32/2,1," PINPAD LOCKED ");
	WriteLog("Test MMK FAILED\n", 1, 0xff);
        for(;;);
    }
    

    Lib_DelayMs(300);
    //Lib_LcdPrintxy(0,32/2,1,"Test MMK....OK");
	Lib_LcdPrintxy(0,8*2,0,"Test MMK....OK");
	WriteLog("Test MMK OK\n", 1, 0xff);


    //Lib_LcdPrintxy(0,48/2,1,"Test KEYS...");
	Lib_LcdPrintxy(0,8*3,0,"Test KEYS...");
	//s_UartPrint(COM_DEBUG,"test keys\r\n");
    //test lrc of keys
    iret=s_CheckAllKeys();
    if(iret)
    {
	s_PciInitMMK();
        //s_PciInitBPK();
        //s_PciClearAllKeys();
        Lib_LcdCls();
        Lib_LcdPrintxy(0,0,1," KEY FAIL  ");
        //Lib_LcdPrintxy(0,48/2,1," PINPAD LOCKED  ");
	Lib_LcdPrintxy(0,32/2,1," PINPAD LOCKED  ");
	WriteLog("Test KEYS FAILED\n", 1, 0xff);
        for(;;);
    }
    Lib_DelayMs(300);
    //Lib_LcdPrintxy(0,48/2,1,"Test KEYS....OK");
    Lib_LcdPrintxy(0,8*3,0,"Test KEYS....OK");
    WriteLog("Test KEYS OK\n", 1, 0xff);



    //s_UartPrint(COM_DEBUG,"self test ok\r\n");
    return 0;
}

DWORD s_AM_ReadMaKey(MAN_APP_KEY *psOutMaKey)
{
    sys_flash_syspara_read(MAN_APP_KEY_M,(uchar*)psOutMaKey,sizeof(MAN_APP_KEY));
}

void s_AM_WriteMaKey(MAN_APP_KEY *psInMaKey)
{
  int nRet;  
  nRet = sys_flash_syspara_write(MAN_APP_KEY_M,(uchar*)psInMaKey,sizeof(MAN_APP_KEY));
  if(nRet)
  {
        Lib_LcdCls();
       /* Lib_LcdGotoxy(0, 0);
        Lib_Lcdprintf("Write flash error!=%d,", iRet);*/
	Lib_LcdPrintxy(0, 8*0,0x00,"Write flash error!=%d,", nRet);
        while (1);
    
  }
  
}
// 0x55:Lock
BYTE AM_GetLockStatus(void)
{
    DWORD dwRet;
    MAN_APP_KEY loc_sMaKey;

    dwRet = s_AM_ReadMaKey(&loc_sMaKey);
    if (AM_SUCCESS != dwRet)
    {
        return 0xff;
    }
    return loc_sMaKey.m_abyLock[0];
}

void AM_CheckPedLock(void)
{
    if (0x55 == AM_GetLockStatus())
    {
        Lib_LcdClrLine(0, LCD_HIGH_MINI-1);
       /* Lib_LcdGotoxy(0, 32);
        Lib_LcdPrintfCE("    PED 被锁    ", "   PED locked!  ");*/
	Lib_LcdPrintxy(0, 8*2,0x00,"   PED locked!  ");
        while (1);
    }
}

void DrawThreeLine(void)
{
  
}

int CheckVOSSignKey(void)
{
	return 0;
#if 0        
    int iRet;
    //DWORD adwMMK[5];
    BYTE abyKey[16]; 
    //iRet = s_PciReadMMK(2, adwMMK);
//    iRet = s_ReadBSK(abyKey);
//    if (0 != iRet)
//    {
//        Lib_LcdCls();
//        Lib_LcdPrintxyCE(0,  0, 0x81, "    系统菜单    ", "   SYSTEM MENU  ");
//        if (-1 == iRet)
//        {
//            Lib_LcdPrintxyCE(0, 20, 0x01, " BSK未下载  ", " Not BSK!  ");
//            Lib_LcdPrintxyCE(0, 40, 0x01, " 请先下载该密钥 ", "Pls load BSK. ");
//        }
//        else
//        {
//            Lib_LcdPrintxyCE(0, 32, 0x01, "读BSK错误  ", "Read BSK error!   ");
//        }
//        DrawThreeLine();
//        Lib_KbFlush();
//        (void)Lib_KbGetCh();
//        return 1;
//    }
    
    
//    iRet=s_CheckBootSign();
//    if(iRet)
//    {
//        Lib_LcdCls();
//        Lib_LcdPrintxy(0,0,1, " BSK&BOOT FAIL ");
//        Lib_LcdPrintxy(0,16,1," PINPAD LOCKED ");
//        for(;;);
//    } 
    
    

    //iRet = s_PciReadMMK(2, adwMMK);
    iRet = s_ReadVSK(abyKey);
    if (0 != iRet)
    {
        Lib_LcdCls();
        //Lib_LcdPrintxyCE(0,  0, 0x80, "    系统菜单    ", "   SYSTEM MENU  ");
		Lib_LcdPrintxy(0,  0, 0x80, "    SYSTEM MENU     ");

        if (-1 == iRet)
        {
            //Lib_LcdPrintxyCE(0, 8*1, 0x00, " VSK未下载  ", " Not VSK!  ");
			 Lib_LcdPrintxy(0, 8*1, 0x00, " Not VSK!  ");
           /* Lib_LcdPrintxyCE(0, 8*2, 0x00, " 请先下载该密钥 ", "Pls load VSK. ");*/
			  Lib_LcdPrintxy(0, 8*2, 0x00, "Pls load VSK. ");
        }
        else
        {
            /*Lib_LcdPrintxyCE(0, 8*2, 0x00, "读VSK错误  ", "Read VSK error!   ");*/
			Lib_LcdPrintxy(0, 8*2, 0x00, "Read VSK error!   ");
        }
        DrawThreeLine();
        Lib_KbFlush();
        (void)Lib_KbGetCh();
        return 1;
    }
    
    
    iRet=s_CheckVosSign();
    if(iRet)
    {
        Lib_LcdCls();
        Lib_LcdPrintxy(0,0,1, " VSK&VOS FAIL ");
        Lib_LcdPrintxy(0,8*2,1," PINPAD LOCKED ");
        for(;;);
    }
    
    
    return 0;
#endif
}



/****************************************************************************
  函数名     :  int SPF_GetAppRunStatus(BYTE AppNo)
  描述       :  查询应用程序运行状态，如果应用程序未载入或者未激活则程序是不会运行的
  输入参数   :  1、BYTE AppNo：应用程序编号，取值0~24
  输出参数   :  无
  返回值     :  0：程序未运行 / 1：程序已运行 / -1：创建文件错误 / -2: 输入参数错误
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2007-08-28  V1.0         创建
****************************************************************************/
int SPF_GetAppRunStatus(BYTE AppNo)
{
    int iRet = SPF_SUCCESS;
    T_SYSTEM_PATA tSystempara;

    if (AppNo >= APP_MAX_NUM)
    {
        return SPF_PARA_ERROR;
    }
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA)); 
    
    
    if(4 == (tSystempara.bAttrib&0x04))
      return 1;
    else
      return 0;
#if 0
    READ_UPDATE(iRet);

