wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
    if (4 == (s_abyBuff[APP_ATTR_BASE_OFFSET+AppNo]&0x04))
    {
        return 1;
    }
    else
    {
        return 0;
    }
#endif
    
}

/****************************************************************************
  函数名     :  int SPF_SetAppRunStatus(BYTE AppNo, BYTE flag)
  描述       :  设置程序运行状态
  输入参数   :  1、BYTE AppNo：应用程序编号，取值0~24
                2、BYTE flag：运行标志
  输出参数   :  无
  返回值     :  0：成功 / -2：输入参数错误 / -3:创建系统参数文件错误
              / -5：程序未载入或者未激活
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2007-08-28  V1.0         创建
****************************************************************************/
int SPF_SetAppRunStatus(BYTE AppNo, BYTE flag)
{
    int iRet = SPF_SUCCESS;
    T_SYSTEM_PATA tSystempara;
    
    if (AppNo >= APP_MAX_NUM)
    {
        return SPF_PARA_ERROR;
    }
    if ((0!=flag) && (1!=flag))
    {
        return SPF_PARA_ERROR;
    }
    
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA)); 
    if (1 == flag)
      tSystempara.bAttrib |=  0x04;
    else
      tSystempara.bAttrib |=  0x03;
    return sys_flash_syspara_write(  SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
#if 0
    READ_UPDATE(iRet);

    if (1 == flag)
    {
        s_abyBuff[APP_ATTR_BASE_OFFSET+AppNo] |= 0x04;
    }
    else
    {
        s_abyBuff[APP_ATTR_BASE_OFFSET+AppNo] &= 0x03;
    }

    return _SPF_WriteFile();
#endif    
}

int SPF_GetAppDownUnLockStatus(BYTE AppNo)
{
    int iRet = SPF_SUCCESS;
    T_SYSTEM_PATA tSystempara;
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    tSystempara.bAttrib &0x08;
    sys_flash_syspara_write(  SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
}

int SPF_SetAppDownUnLockStatus(BYTE AppNo)
{
    int iRet = SPF_SUCCESS;
    T_SYSTEM_PATA tSystempara;
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    
    tSystempara.bAttrib &=0xf7;
    
}

/****************************************************************************
  函数名     :  int SPF_GetAppStatus(BYTE AppNo)
  描述       :  查询应用程序状态
  输入参数   :  1、BYTE AppNo：应用程序编号，取值0~24
  输出参数   :  无
  返回值     :  0~7表示应用程序状态
               / -2:SPF_PARA_ERROR / -1:SPF_CREATE_FILE_ERROR
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2007-10-10  V1.0         创建
****************************************************************************/
int SPF_GetAppStatus(BYTE AppNo)
{
    int iRet = SPF_SUCCESS;
    T_SYSTEM_PATA tSystempara;
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    return tSystempara.bAttrib &0x07;
#if 0    
    if (AppNo >= APP_MAX_NUM)
    {
        return SPF_PARA_ERROR;
    }

    READ_UPDATE(iRet);

    return (s_abyBuff[APP_ATTR_BASE_OFFSET+AppNo]&0x07);
#endif    
}
/****************************************************************************
  函数名     :  int SPF_GetAppName(BYTE byAppNO, char *pName)
  描述       :  根据应用程序序号查询应用程序名
  输入参数   :  1、BYTE byAppNO：应用程序序号 ，取值0~24
  输出参数   :  1、char *pName：应用程序名，该参数长度不小于32字节
  返回值     :  SPF_SUCCESS / SPF_CREATE_FILE_ERROR / SPF_PARA_ERROR
                / SPF_APP_NOEXIST
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2007-08-28  V1.0         创建
****************************************************************************/
int SPF_GetAppName(BYTE byAppNO, char *pName)
{
    int iRet = SPF_SUCCESS;

    T_SYSTEM_PATA tSystempara;
    
    if (NULL == pName)
    {
        return SPF_PARA_ERROR;
    }
    if (byAppNO >= APP_MAX_NUM)
    {
        return SPF_PARA_ERROR;
    }
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    if( (tSystempara.bAttrib&0x01)==0)
      return SPF_APP_NOEXIST;
    memcpy(pName,  tSystempara.AppName,32);  
    
#if 0
    READ_UPDATE(iRet);

    if (0 == (s_abyBuff[APP_ATTR_BASE_OFFSET+byAppNO]&0x01))
    {
        return SPF_APP_NOEXIST;
    }
    memcpy(pName, (char *)s_abyBuff+APP_NAME_BASE_OFFSET+byAppNO*APP_INFO_LEN, 32);
    
#endif
    
    //printf("appno=%d pname=%s\r\n",byAppNO,pName);
    return SPF_SUCCESS;
}

/****************************************************************************
  函数名     :  int SPF_GetAppNO(const char *pName)
  描述       :  根据应用程序名查询应用程序的序号
  输入参数   :  1、const char *pName：应用程序名
  输出参数   :  无
  返回值     :  0~24：应用程序序号 / -2:SPF_PARA_ERROR / -1:SPF_CREATE_FILE_ERROR
               / -3:SPF_APP_NOEXIST
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2007-08-28  V1.0         创建
****************************************************************************/
int SPF_GetAppNO(const char *pName)
{
    T_SYSTEM_PATA tSystempara;
    int i = 0,iRet = SPF_SUCCESS;

    if (NULL == pName)
    {
        return SPF_PARA_ERROR;
    }
    //only one app
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    if( (tSystempara.bAttrib&0x01)==0)
      return SPF_APP_NOEXIST;
    
#if 0    
    if(strcmp(tSystempara.AppName,pName)==0)
      return 0;
#endif
    return 0;
    
    return SPF_APP_NOEXIST;

}

int SPF_GetDownloadOK(BYTE byAppNO, char *pDownloadOK)
{
    T_SYSTEM_PATA tSystempara;
    
    if (byAppNO >= APP_MAX_NUM)
    {
        return SPF_PARA_ERROR;
    }
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    if( (tSystempara.bAttrib&0x01)==0)
      return SPF_APP_NOEXIST;
    memcpy(pDownloadOK,tSystempara.sDownloadOK,10);
    return 0;
}

/****************************************************************************
  函数名     :
  描述       :
  输入参数   :
  输出参数   :
  返回值     :
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/
void LoadApp(void)
{
    int i, fd, cnt;
    //DWORD StartAddr, EntryAddr, dwAppInfo; 
    char strAppFileName[17], strAppName[33];
    int iRet, iFileLen, iAppNum;
    APP_MSG *pAppMsg;
    //SAppInfo sAppInfo;
    BYTE abyTemp[41], byKeyLen, abyResult[10], *pbyAddr, abyData[10];

    Lib_LcdCls();
    /*(void)Lib_LcdSetFont(8, 16, 0);
    (void)Lib_LcdSetAttr(1);
    Lib_LcdGotoxy(0, 0);
    Lib_LcdPrintfCE("    系统菜单    ", "     SYSTEM MENU    ");*/
	Lib_LcdPrintxy(0, 8*0,0x80,"      SYSTEM MENU     ");
    DrawThreeLine();
   /* (void)Lib_LcdSetAttr(0);
    Lib_LcdGotoxy(0, 32/2);*/
    for (i = 0; i < 25; i++)
    {
        iRet = SPF_GetAppStatus(i);
        if ((iRet>0) && ((iRet&0x03)==0x03))
        {
            break;
        }
    }
    if (i >= 25)
    {
        //Lib_LcdPrintfCE("    无 应 用    ", "   No program   ");
		Lib_LcdPrintxy(0, 8*2,0x00, "   No program   ");
        Lib_KbFlush();
        (void)Lib_KbGetCh();
        Lib_LcdClrLine(2*8,LCD_HIGH_MINI-1);
		WriteLog("No Program\n", 1, 0xff);
        return;
    }
    iAppNum = i;
    iRet = SPF_GetAppName(iAppNum, strAppName);
    if (0 != iRet)
    {
        //Lib_LcdPrintfCE("  读应用名错误  ", "Read appname err");
		Lib_LcdPrintxy(0, 8*2,0x00, "Read appname err");
        Lib_KbFlush();
        (void)Lib_KbGetCh();
        Lib_LcdClrLine(2*8/2,LCD_HIGH_MINI-1);
		WriteLog("Read AppName Error\n", 1, 0xff);
        return;
    }
    
