wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
#if 0    
    memset(strAppFileName,0,sizeof(strAppFileName));
    sprintf(strAppFileName, "AppFile%d", i);
    iFileLen = Lib_FileSize(strAppFileName);

    *(volatile ulong*)APP_APPMAN_FLAG_SPACE = 0x00;
    if (i == 0)
    {
        fd = s_open(strAppFileName, O_RDWR, (uchar *)"\xff\x00");
        StartAddr = APPMAN_RUN_SPACE;
        *(volatile ulong*)APP_APPMAN_FLAG_SPACE = 0xff00;
    }
    else
    {
        fd = s_open(strAppFileName, O_RDWR, (uchar *)"\xff\x01");
        StartAddr = APP_RUN_SPACE;
    }

    if (fd < 0)
    {
        //Lib_LcdPrintfCE("    无 应 用    ", "   No program   ");
		Lib_LcdPrintxy(0, 8*2,0x00, "   No program   ");
        Lib_KbFlush();
        (void)Lib_KbGetCh();
        Lib_LcdClrLine(2*8,LCD_HIGH_MINI-1);
		WriteLog("No Program\n", 1, 0xff);
        return;
    }
    EntryAddr = StartAddr;

    i=0;
    while (1)
    {
        cnt = Lib_FileRead(fd, gFileBuffer, sizeof(gFileBuffer));
        memcpy_byte((BYTE*)StartAddr, gFileBuffer, cnt);
        StartAddr += cnt;
        if(i==0)
        {
            i=1;
        }

        if (cnt < sizeof(gFileBuffer))
            break;
    }
    (void)Lib_FileClose(fd);
#endif
    
    iRet = SPF_GetDownloadOK(iAppNum,abyTemp); //add 
    //if(memcmp((BYTE *)(StartAddr-10),APP_DOWNLOAD_OK_FLAG,10))
    if( iRet ||   memcmp(abyTemp,APP_DOWNLOAD_OK_FLAG,10) )
    {
        //Lib_LcdPrintfCE("应用程序不完整", "App check err");
        Lib_LcdPrintxy(0, 8*2,0x00, "App check err");
        Lib_KbFlush();
        Lib_KbGetCh();
        Lib_LcdClrLine(2*8/2,LCD_HIGH_MINI-1);
	 WriteLog("App Check Error\n", 1, 0xff);
        for(;;);
        return;
    }

#ifndef BPK_DEBUG
    Lib_Hash((BYTE *)EntryAddr, iFileLen-40, abyTemp);
    pbyAddr = (BYTE *)(StartAddr-40);
    if (0 != memcmp(pbyAddr,abyTemp,20))
    {
        //Lib_LcdPrintfCE("应用程序Hash错", "App hash error");
		Lib_LcdPrintxy(0, 8*2,0x00, "App hash error");
        Lib_KbFlush();
        (void)Lib_KbGetCh();
        Lib_LcdClrLine(2*8/2,LCD_HIGH_MINI-1);
		WriteLog("App Hash Error\n", 1, 0xff);
        return;
    }
    iRet = s_ReadAuthKey(strAppName, AUTHAPP_TYPE, 0, &byKeyLen, abyTemp);
    if ((0!=iRet) || (24!=byKeyLen))
    {
        //Lib_LcdPrintfCE("应用签名密钥错误", "Read sign key err");
		Lib_LcdPrintxy(0, 8*2,0x00, "Read sign key err");
  //      Lib_Lcdprintf(",%d,%d,", byKeyLen,iRet);
        Lib_KbFlush();
        (void)Lib_KbGetCh();
        Lib_LcdClrLine(2*8/2,LCD_HIGH_MINI-1);
		WriteLog("Read Sign Key Error\n", 1, 0xff);
        return;
    }
    s_DesMac24(pbyAddr, abyTemp, abyResult);
/*    Lib_Des24(pbyAddr, abyResult, abyTemp, 1);
    for (i=0; i<8; i++)
    {
        abyResult[i] ^= pbyAddr[i+8];
    }
    Lib_Des24(abyResult, abyData, abyTemp, 1);
    for (i=0; i<8; i++)
    {
        abyData[i] ^= pbyAddr[i+16];
    }
    Lib_Des24(abyData, abyResult, abyTemp, 1);*/
    pbyAddr = (BYTE *)(StartAddr-16);
    if (0 != memcmp(abyResult,pbyAddr,6))
    {
        //Lib_LcdPrintfCE("应用签名校验错误", "Signkey check err");
		Lib_LcdPrintxy(0, 8*2,0x00, "Signkey check err");
        Lib_KbFlush();
        (void)Lib_KbGetCh();
        Lib_LcdClrLine(2*8/2,LCD_HIGH_MINI-1);
		WriteLog("Signkey Check Error\n", 1, 0xff);
        return;
    }

#endif
 
    g_byCurAppNum = iAppNum;  // 运行应用程序 move
   
#if 0
    Down_Close();
    StartAddr = EntryAddr;
    GetAppEntry((uchar *)EntryAddr, &EntryAddr, NULL, &dwAppInfo);
    pAppMsg = (APP_MSG *)(APP_RUN_SPACE+dwAppInfo);
    pAppMsg->Num = iAppNum;
    iRet = SPF_GetAppInfo(&sAppInfo, iAppNum);
    if (0 == iRet)
    {
        ConvertBcdTimeToStr(sAppInfo.DownloadTime, pAppMsg->LoadTime);
    }
    EntryAddr += StartAddr;
    s_InitDll();
    Lib_KbFlush();
    (void)Lib_LcdSetFont(8, 16, 0);

    g_byCurAppNum = iAppNum;  // 运行应用程序
	//ClearIDCache();

	//__syscall(3);
	//switch_to_user_mode_new(EntryAddr);
#ifndef DLL_NOT_SWI
	switch_to_user_mode(EntryAddr);
#endif

	ClearIDCache();
    CallMain = (void (*)(void))EntryAddr;
    CallMain();
    ClearIDCache();
    g_byCurAppNum = 0xff;  // 运行VOS
    
	WriteLog("Load App OK\n", 1, 0xff);
	Down_Open();
#endif    
        
    return;
}

/****************************************************************************
  函数名     :  int SPF_GetSN(BYTE *pbySN)
  描述       :  查询序列号
  输入参数   :  无
  输出参数   :  1、BYTE *pbySN：基本序列号，最长32个字节
            注意：输入的数组长度必须不小于33个字节
  返回值     :  SPF_SUCCESS / SPF_PARA_ERROR / SPF_CREATE_FILE_ERROR
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2007-08-28  V1.0         创建
****************************************************************************/
int SPF_GetSN(BYTE *pbySN)
{
    T_SYSTEM_PATA tSystempara;
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    memcpy(pbySN,tSystempara.bSN,SERIAL_NUMBER_LEN);
  
#if 0 //12/10/28
    int iRet = SPF_SUCCESS;

    if (NULL == pbySN)
    {
        return SPF_PARA_ERROR;
    }

    READ_UPDATE(iRet);

    memcpy(pbySN, s_abyBuff, SERIAL_NUMBER_LEN);
    pbySN[SERIAL_NUMBER_LEN] = 0;
#endif    
    return SPF_SUCCESS;
}

/****************************************************************************
  函数名     :  int SPF_SetSN(const BYTE *pbyBaseSN)
  描述       :  修改序列号
  输入参数   :  1、const BYTE *pbySN：基本序列号，
                注意：数组pbySN的长度必须不小于33个字节
  输出参数   :  无
  返回值     :  SPF_SUCCESS / SPF_PARA_ERROR / SPF_CREATE_FILE_ERROR
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2007-08-28  V1.0         创建
****************************************************************************/
int SPF_SetSN(const BYTE *pbySN)
{
    T_SYSTEM_PATA tSystempara;
    sys_flash_syspara_read(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    if (NULL == pbySN)
    {
        return SPF_PARA_ERROR;
    }
    memcpy(tSystempara.bSN, pbySN, SERIAL_NUMBER_LEN);
    return sys_flash_syspara_write(SYSPARA_M,(BYTE *)&tSystempara,sizeof(T_SYSTEM_PATA));
    
    //return 0;
#if 0    //12/10/28
    int iRet = SPF_SUCCESS;

    if (NULL == pbySN)
    {
        return SPF_PARA_ERROR;
    }

    READ_UPDATE(iRet);

    memcpy(s_abyBuff, pbySN, SERIAL_NUMBER_LEN);

