wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
    return _SPF_WriteFile();
#endif    
}

int Lib_ReadSN(uchar *SerialNo)
{
#if 0
    int i,fd;
    unsigned char TmpSN[40];//32->40 13/01/28

    fd = SPF_GetSN(TmpSN);
    if(fd < 0)
    {
        SerialNo[0]=0;
        return -1;
    }
    for(i=0;i<40;i++) //32->40
    {
        if(!TmpSN[i])
            break;
        else
            SerialNo[i]=TmpSN[i];
    }
    SerialNo[i]=0;  
    return 0;
#else
    return SPF_GetSN(SerialNo);
#endif
}

int Lib_WriteSN(BYTE *SN)
{
#if 0
    int fd;
    unsigned char TmpSN[41];//32->40 13/01/28
    memset(TmpSN,0,41);
    strcpy((char *)TmpSN,(char *)SN);
    fd = SPF_SetSN(TmpSN);
    if(fd < 0)
    {
        return -1;
    }
    return 0;
#else
    return SPF_SetSN(SN);
#endif
}

/****************************************************************************
  函数名     :
  描述       :
  输入参数   :
  输出参数   :
  返回值     :
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/
//void ShowVosVersion(void)
extern unsigned long LCDValue;
int ShowVosVersion(void)

{
    int fd,i;
    uchar ret;
    uchar sn[41], VerInfo[9];//33->41

    memset(sn, 0, 41);
    memset(VerInfo, 0, 9);
    fd = SPF_GetSN(sn);
#if 0    
    if (fd < 0)
    {
        sn[0] = 0;
    }
    else
    {
        sn[12] = 0;
    }
#endif

    Lib_LcdCls();
    /*Lib_LcdSetFont(8, 16, 0);
    (void)Lib_LcdSetAttr(1);
    Lib_LcdGotoxy(0, 0);
    Lib_LcdPrintfCE("    版本信息    " , "      Version Info    ");
    (void)Lib_LcdSetAttr(0);
    Lib_LcdGotoxy(0, 2*8/2);
    Lib_LcdPrintfCE("  1-NAME    ", " NAME: VPOS35S ");
    Lib_LcdGotoxy(0, 4*8/2);
    Lib_LcdPrintfCE("  2-VERINFO    ", " BOOT: (1.0) ");
    Lib_LcdGotoxy(0, 6*8/2);
    Lib_LcdPrintfCE("  3-VERNO    ", " VOS : (1.0) ");*/
	Lib_LcdPrintxy(0,8*0,0x80,"     Version Info   ");
        
	//Lib_LcdPrintxy(0,8*1,0x00,"NAME:V10P BOOT:2.13" ); //2.13 2.23 13/06/27 
#ifdef V10X
        Lib_LcdPrintxy(0,8*1,0x00,"NAME:V10" ); //sxl 13/10/09 //lb,2.33->2.38,20150929
#else
        Lib_LcdPrintxy(0,8*1,0x00,"NAME:V10" ); //sxl 13/10/09 //lb,2.34->2.38,20150929
#endif

#if 1         
        Lib_LcdPrintxy(0,8*2,0x00, "SN:");
        Lib_LcdSetAttr(0);
        Lib_LcdSetFont(8, 16, 0);
        Lib_LcdGotoxy(3*6, 8*2);
        i = 2;
        while (1) {
          if( (sn[i]>='0') && (sn[i]<='9') || 
              ((sn[i]>= 'a') && (sn[i]<='f')) || 
              ((sn[i]>= 'A') && (sn[i]<='F')))
            Lib_Lcdprintf("%c",sn[i++]);
          else
            break;
          
          if(LCDValue >= 3000)  //LCD_AD_FLAG = 3000
          {
                if (i >= 39)
                    break;
          }
          else
          {
              if (i >= 40)
                break;

          }
          //if (i >= 40)
          //  break;
        }
#endif 
#if 0
    Lib_LcdCls();
    Lib_LcdPrintxy(0, 0*8, 0x00,"LCDValue:%d",LCDValue);
    Lib_KbGetCh();
    
    sn[39] = 0;
    if( (sn[0]>='0') && (sn[0]<='9'))
    {
        Lib_LcdPrintxy(0,2*8,0x00, "SN:");
        for(i=2;i<19;i++)
            Lib_LcdPrintxy((i+1)*6,2*8,0x00, "%c",sn[i]);     
        Lib_LcdPrintxy(0,3*8,0x00, "%s",&sn[19]);
    }
#endif       
        
        
#if 0        
	/*Version specified by makefile*/
	#ifdef FIRMWARE_VERSION
	    Lib_LcdPrintxy(0,3*8,0," VOS : (%d.%d.%d)", FIRMWARE_MAJOR_VERSION, FIRMWARE_MINOR_VERSION, FIRMWARE_MODIFIED_VERSION);
	#else
	    Lib_LcdPrintxy(0,3*8,0," VOS : (%d.%d.%d)", 0, 0, 0);
	#endif	
#endif
            
    /*if(sn[0])
    {
        Lib_LcdPrintxy(0,5*8,0," S/N : %s", sn);
    }
    else
    {
        Lib_LcdPrintxy(0,5*8,0," S/N : NULL");
    }
    if(!VerInfo[5])
    { 
		Lib_LcdPrintxy(0,6*8,0," Main: **  "); 
    }
    else
    { 
		Lib_LcdPrintxy(0,6*8,0," Main: %02d  ",VerInfo[5]); 
    }*/
    DrawThreeLine();

    (void)Lib_LcdSetFont(8, 16, 0);
    ret = Lib_KbGetCh();
    if (ret == KEYCANCEL)
    {
        if (0 == CheckVOSSignKey())
        {
            LoadApp();
            return 0xff;
        }
        return 0;
    }
    return 0;
}

/****************************************************************************
  函数名     :  DWORD ManageLogin(void)
  描述       :  1、用户登录处理函数
  输入参数   :  无
  输出参数   :  无
  返回值     :  AM_SUCCESS / AM_USER_PRESS_CANCEL
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2008-09-28  V1.0         创建
****************************************************************************/
DWORD ManageLogin(void)
{
#ifdef VOSSIGN_ENABLE    
    DWORD dwRet;
    while (1)
    {
        dwRet = AM_Login(AM_MANAGE_NO1);
        if (AM_SUCCESS == dwRet)
        {
			WriteLog("Login OK\n", 1, AM_MANAGE_NO1);
            break;
        }
		else if (AM_INPUT_TIME_OUT == dwRet)
		{
			Lib_LcdClrLine(16/2, LCD_HIGH_MINI-1);
            Lib_LcdGotoxy(0, 48/2);
            //Lib_LcdPrintfCE("用户输入超时！", "Input Timeout!");
			Lib_LcdPrintxy(0, 8*3,0x00,"Input Timeout!");
            Lib_DelayMs(1000);
			WriteLog("Login Failed\n", 1, AM_MANAGE_NO1);
			return AM_INPUT_TIME_OUT;
		}
        else if (AM_USER_PRESS_CANCEL == dwRet)
        {
			WriteLog("Login Failed\n", 1, AM_MANAGE_NO1);
            return AM_USER_PRESS_CANCEL;
        }
        Lib_DelayMs(3000);
    }
    while (1)
    {
        dwRet = AM_Login(AM_MANAGE_NO2);
        if (AM_SUCCESS == dwRet)
        {
			WriteLog("Login OK\n", 1, AM_MANAGE_NO2);
            return AM_SUCCESS;
        }
		else if (AM_INPUT_TIME_OUT == dwRet)
		{
			Lib_LcdClrLine(16/2, LCD_HIGH_MINI-1);
            Lib_LcdGotoxy(0, 48/2);
            //Lib_LcdPrintfCE("用户输入超时！", "Input Timeout!");
			Lib_LcdPrintxy(0, 8*3,0x00,"Input Timeout!");
            Lib_DelayMs(1000);
			WriteLog("Login Failed\n", 1, AM_MANAGE_NO2);
			return AM_INPUT_TIME_OUT;
		}
        else if (AM_USER_PRESS_CANCEL == dwRet)
        {
			WriteLog("Login Failed\n", 1, AM_MANAGE_NO2);
            return AM_USER_PRESS_CANCEL;
        }
        Lib_DelayMs(3000);
    }
#endif    
    return AM_SUCCESS;
}

/****************************************************************************
  函数名     :  void ShowMainMenu(BYTE *page_no)
  描述       :  显示操作选择提示菜单
  输入参数   :  BYTE *page_no : 页号
  输出参数   :  无
  返回值     :  1：文件对拷
                2：系统测试
                3：下载密钥
                4：修改密钥
                5：PED 解锁
                6: 设置对比度
                0xff：本地下载
                0x10：显示版本
                0x11：运行应用
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
1、   黄俊斌     2007-10-15  V1.0         创建
****************************************************************************/
int ShowSystemMenu(void)
{
    static int iCurPage = 0;
    int iPageChange = 1;
    BYTE ch;

    s_SetTimer(0,6000);  //modify 5mins to 1mins 
    while (1)
    {
      
        if(!s_CheckTimer(0))
        {
            Lib_LcdClrLine(16/2, LCD_HIGH_MINI-1);
           /* Lib_LcdGotoxy(0, 32/2);
            Lib_LcdPrintfCE("    等待超时    ", "TimeOut For Load");*/
			Lib_LcdPrintxy(0,8*2,0, "TimeOut For Load");
            Lib_DelayMs(2000);
            return KM_WAIT_TIMEOUT_ERROR;
        } 
        
        if(!s_CheckTimer(3))
        {
            Lib_LcdClrLine(16/2, LCD_HIGH_MINI-1);
           /* Lib_LcdGotoxy(0, 32/2);
            Lib_LcdPrintfCE("    等待超时    ", "TimeOut Quit");*/
			Lib_LcdPrintxy(0,8*2,0, "TimeOut Quit");
            Lib_DelayMs(2000);
            return KM_WAIT_TIMEOUT_ERROR;
        } 
        
        
