wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
        if (1 == iPageChange)
        {
            Lib_LcdCls();
            /*(void)Lib_LcdSetFont(8, 16, 0);
            (void)Lib_LcdSetAttr(1);
            Lib_LcdGotoxy(0, 0);
            Lib_LcdPrintfCE("    系统菜单    ", "     SYSTEM MENU     ");*/
			Lib_LcdPrintxy(0,8*0,0x80, "      SYSTEM MENU      ");

            (void)Lib_LcdSetAttr(0);
            switch (iCurPage)
            {
            case 0:
                /*Lib_LcdGotoxy(0, 2*8/2);
                Lib_LcdPrintfCE("  1-下载密钥    ", " 1-Load Key    ");

                Lib_LcdGotoxy(0, 4*8/2);
                Lib_LcdPrintfCE("  2-系统测试    ", " 2-SystemTest  ");

                Lib_LcdGotoxy(0, 6*8/2);
                Lib_LcdPrintfCE("  3-修改密码    ", " 3-Change Pwd  ");*/
				Lib_LcdPrintxy(0,8*1,0x00, " 1-Load Key    ");
				//Lib_LcdPrintxy(0,8*2,0x00, " 2-SystemTest  ");
				Lib_LcdPrintxy(0,8*2,0x00, " 2-Set LcdGray  ");
				Lib_LcdPrintxy(0,8*3,0x00, " 3-Change Pwd  ");

				break;
			case 1:
				/*Lib_LcdGotoxy(0, 2*8/2);
                Lib_LcdPrintfCE("  4-自检测试    ", " 4-Self Test   ");
				Lib_LcdGotoxy(0, 4*8/2);
                Lib_LcdPrintfCE("  5-设置对比度  ", " 5-Set LcdGray ");

                Lib_LcdGotoxy(0, 6*8/2);
                Lib_LcdPrintfCE("  6-上传日志    ", " 6-Send Log  ");*/
#if 0                          
				Lib_LcdPrintxy(0,8*1,0x00, " 4-Self Test   ");
				Lib_LcdPrintxy(0,8*2,0x00, " 5-Set LcdGray ");
#endif                                
				Lib_LcdPrintxy(0,8*3,0x00, " 6-Send Log    ");

                break;
            default:
                break;
            }
            DrawThreeLine();
            iPageChange = 0;
        }
        
        if (0 == CheckHandShack())
        {
            s_SetTimer(0,6000);  //modify 5mins to 1mins
            return 0xff;
        }
        
        
        if (0 == Lib_KbCheck())
        {
          
            s_SetTimer(0,6000);  //modify 5mins to 1mins
            ch = Lib_KbGetCh();
            
            
            switch (ch)
            {
            case KEYUP:
                if (iCurPage > 0)
                {
                    iCurPage--;
                }
                else
                {
                    iCurPage = 1;
                }
                iPageChange = 1;
                break;
            case KEYDOWN:
                if (iCurPage < 1)
                {
                    iCurPage++;
                }
                else
                {
                    iCurPage = 0;
                }
                iPageChange = 1;
                break; 
            case '1':
                if (0 == iCurPage)
                {
                    return 1;
                }
                break;
            case '2':
                if (0 == iCurPage)
                {
                    return 2;
                }
                break;
            case '3':
                if (0 == iCurPage)
                {
                    return 3;
                }
                break;
             case '4':
                if (1 == iCurPage)
                {
                    return 4;
                }
                break;
              
            case '5':
                if (1 == iCurPage)
                {
                    return 5;
                }
                break;
  
            case '6':
                if (1 == iCurPage)
                {
                    return 6;
                }
                break;
/*            case '7':
                if (2 == iCurPage)
                {
                    return 7;
                }
                break;*/
            case KEYENTER:
                return 0x10;
            case KEYCANCEL:
                return 0x11;
            default:
                break;
            }
        }
    }
}




// 0:fault, 1:ok
BYTE ISAllCharInString(BYTE *pAllChar, BYTE AllCharLen, BYTE *str, BYTE strLen)
{
    BYTE i, j;
    BYTE chFlag = 0;
    for (i=0; i<AllCharLen; i++)
    {
        chFlag = 0;
        for (j=0; j<strLen; j++)
        {
            if (pAllChar[i] == str[j])
            {
                chFlag = 1;
                break;
            }
        }
        if (0 == chFlag)
        {
            return 0;
        }
    }
    return 1;
}
void StringToHex(BYTE *pbyInData, int iInLen, BYTE *pbyOut)
{
    int i;

    if (0 != (iInLen%2))
    {
        pbyInData[iInLen] = 0;
        iInLen++;
    }
    for (i=0; i<iInLen; i+=2)
    {
        if ((pbyInData[i]>='A') && (pbyInData[i]<='F'))
        {
            pbyOut[i/2] = (BYTE)((pbyInData[i]-'A'+10)*16);
        }
        else if ((pbyInData[i]>='a') && (pbyInData[i]<='f'))
        {
            pbyOut[i/2] = (BYTE)((pbyInData[i]-'a'+10)*16);
        }
        else
        {
            pbyOut[i/2] = (BYTE)((pbyInData[i]-'0')*16);
        }

        if ((pbyInData[i+1]>='A') && (pbyInData[i+1]<='F'))
        {
            pbyOut[i/2] |= (BYTE)((pbyInData[i+1]-'A'+10)&0x0f);
        }
        else if ((pbyInData[i+1]>='a') && (pbyInData[i+1]<='f'))
        {
            pbyOut[i/2] |= (BYTE)((pbyInData[i+1]-'a'+10)&0x0f);
        }
        else
        {
            pbyOut[i/2] |= (BYTE)((pbyInData[i+1]-'0')&0x0f);
        }
    }
}

/****************************************************************************
  函数名     :  int InputPassword(BYTE *pbyOutPassword, BYTE byDisplayInfo, BYTE byKeyMode)
  描述       :  让用户输入密码
  输入参数   :  1、BYTE byDisplayInfo : 显示提示信息，可取值0~3，其他值不显示信息
                2、BYTE byKeyMode : 密码的显示方式，0表示明码方式显示，1表示密码方式显示
  输出参数   :  1、BYTE *pbyOutPassword : 8字节的密码
  返回值     :  SUCCESS / USER_INPUT_ERROR / USER_PRESS_KEYCANCEL
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2008-04-08  V1.0         创建
  1、 黄俊斌     2008-09-19  V1.1         移植到VPOS306
****************************************************************************/
DWORD InputPassword(BYTE *pbyOutPassword, BYTE byDisplayInfo, BYTE byKeyMode)
{
    BYTE byMode;
    BYTE abyTemp[20];
    int iRet;

    Lib_LcdClrLine(32/2, LCD_HIGH_MINI-1);
    //Lib_LcdGotoxy(0, 32/2);
    switch (byDisplayInfo)
    {
    case 0:
        //Lib_LcdPrintfCE(" 输入密码:", " Password:");
		Lib_LcdPrintxy(0, 8*2,0x00," Password:");
        break;
    case 1:
        //Lib_LcdPrintfCE(" 确认密码:", " Confirm Pwd:");
		Lib_LcdPrintxy(0, 8*2,0x00," Confirm Pwd:");
        break;
    case 2:
        //Lib_LcdPrintfCE(" 输入新密码:", " New Pwd:");
		Lib_LcdPrintxy(0, 8*2,0x00," New Pwd:");
        break;
    case 3:
        //Lib_LcdPrintfCE(" 确认新密码:", " Confirm Pwd:");
		Lib_LcdPrintxy(0, 8*2,0x00," Confirm New Pwd:");
        break;
    case 4:
        //Lib_LcdPrintfCE(" 输入原密码:", " Old Pwd:");
		Lib_LcdPrintxy(0, 8*2,0x00," Old Pwd:");
        break;
    }
    if (0 == byKeyMode)
    {
        byMode = 0x55;  // 明码方式
    }
    else
    {
        byMode = 0x5d;  // 密码方式
    }
    while (1)
    {
        Lib_LcdClrLine(48/2, LCD_HIGH_MINI-1);
        Lib_LcdGotoxy(0, 48/2);
        //Lib_Lcdprintf("[                 ]");
        //Lib_LcdGotoxy(8, 48);
		Lib_LcdGotoxy(0, 48/2);
        abyTemp[0] = 0;
        iRet = Lib_KbGetStr(abyTemp, AM_MANAGE_PWD_LEN*2,
            AM_MANAGE_PWD_LEN*2, byMode, 60);//change 120 to 60
        if (KB_UserCancel_Err == iRet)
        {
            return AM_USER_PRESS_CANCEL;
        }
		else if(KB_InputTimeOut_Err == iRet)
		{
			return AM_INPUT_TIME_OUT;
		}

