wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
        else if (0 == iRet)
        {
            if (1 == ISAllCharInString(abyTemp, AM_MANAGE_PWD_LEN*2,
                "0123456789abcdefABCDEF", 22))
            {
                break;
            }
           /* Lib_LcdClrLine(48/2, LCD_HIGH_MINI-1);
            Lib_LcdGotoxy(0, 48/2);
            Lib_LcdPrintfCE("用户输入非法字符", "Input error char");*/
			Lib_LcdClrLine(8*3, LCD_HIGH_MINI-1);
			Lib_LcdPrintxy(0, 8*3,0x00,"Input error char");
        }
        else
        {
            /*Lib_LcdClrLine(48/2, LCD_HIGH_MINI-1);
            Lib_LcdGotoxy(0, 48/2);
            Lib_LcdPrintfCE("用户输入错误", "Input error!");*/
			Lib_LcdClrLine(8*3, LCD_HIGH_MINI-1);
			Lib_LcdPrintxy(0, 8*3,0x00,"Input error!");
        }
        Lib_KbGetCh();
    }
    StringToHex(abyTemp, AM_MANAGE_PWD_LEN*2, pbyOutPassword);
    return AM_SUCCESS;
}

// 输出参数以明文输出
DWORD AM_ReadManageKey(int iManageNo, MANAGE_KEY *psManageKey)
{
    BYTE abyCrc32[4];
    int iRet;
    DWORD dwRet;
    BYTE abyMMK1[24];
    MAN_APP_KEY loc_sMaKey;

    if (iManageNo >= MANAGE_NUMBER)
    {
        return AM_MANAGE_NOT_EXIST;
    }
    dwRet = s_AM_ReadMaKey(&loc_sMaKey);
    if (AM_SUCCESS != dwRet)
    {
        return dwRet;
    }
    memcpy(psManageKey, &(loc_sMaKey.asManKey[iManageNo]), sizeof(MANAGE_KEY));
    memset(&loc_sMaKey, 0, sizeof(MAN_APP_KEY));
    //if (0 != memcmp(&g_wValidateFlag,psManageKey->abyFlag,2))
    if (0 != memcmp("\x55\x55",psManageKey->abyFlag,2))
    {
        return AM_INVALIDATE;  // 密钥未初始化
    }
    QuickCrc32((BYTE*)psManageKey, sizeof(MANAGE_KEY)-4, abyCrc32);
    if (0 != memcmp(abyCrc32,psManageKey->abyCrc32,4))
    {
        return AM_CRC_CHECK_ERROR;
    }
    iRet = s_PciReadMMK(MA_MMK_INDEX, (DWORD*)abyMMK1);
    if (AM_SUCCESS != iRet)
    {
        return AM_READ_MMK_ERROR;
    }
    Lib_DES3_16(psManageKey->abyKeyData, abyMMK1, DECRYPT);
    Lib_DES3_16(&(psManageKey->abyKeyData[8]), abyMMK1, DECRYPT);
    Lib_DES3_16(&(psManageKey->abyKeyData[16]), abyMMK1, DECRYPT);
    memset(abyMMK1, 0, sizeof(abyMMK1));
    return AM_SUCCESS;  
}

/****************************************************************************
  函数名     :  DWORD AM_InputNewPassword(BYTE *pbyOutPassword, BYTE byKeyMode)
  描述       :  获取操作员密码
  输入参数   :  1、BYTE byKeyMode : 密码的显示方式，0表示明码方式显示，1表示密码方式显示
  输出参数   :  1、BYTE *pbyOutPassword : 操作员密码，占8个字符?
                     输出值为"00000000"~"00999999"
  返回值     :  AM_SUCCESS / AM_USER_PRESS_CANCEL / AM_USER_INPUT_ERROR
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、 黄俊斌     2008-04-08  V1.0         创建
****************************************************************************/
DWORD AM_InputNewPassword(BYTE *pbyOutPassword, BYTE byKeyMode)
{
    BYTE abyTemp[20],
        byRetryTimes = 0;
    DWORD dwRet;
    while (1)
    {
        byRetryTimes++;
        if (byRetryTimes > 3)
        {
            return AM_USER_INPUT_ERROR;
        }
        dwRet = InputPassword(pbyOutPassword, 2, byKeyMode);
        if (AM_USER_PRESS_CANCEL == dwRet)
        {
            return AM_USER_PRESS_CANCEL;
        }
		else if (AM_INPUT_TIME_OUT == dwRet)
		{
			return AM_INPUT_TIME_OUT;
		}

        else if (AM_SUCCESS != dwRet)
        {
            Lib_LcdClrLine(32/2, LCD_HIGH_MINI-1);
           /* Lib_LcdGotoxy(0, 32/2);
            Lib_LcdPrintfCE(" 输入错误", "  Input error!");
            Lib_LcdGotoxy(0, 48/2);
            Lib_LcdPrintfCE(" 请重新输入！", "  Reinput PWD");*/
			Lib_LcdPrintxy(0, 8*2,0x00,"  Input error!");
			Lib_LcdPrintxy(0, 8*3,0x00,"  Reinput PWD");
            (void)Lib_KbGetCh();
            continue;
        }
        dwRet = InputPassword(abyTemp, 3, byKeyMode);
        if (AM_USER_PRESS_CANCEL == dwRet)
        {
            return AM_USER_PRESS_CANCEL;
        }
		else if (AM_INPUT_TIME_OUT == dwRet)
		{
			return AM_INPUT_TIME_OUT;
		}
        else if (AM_SUCCESS != dwRet)
        {
            Lib_LcdClrLine(32/2, LCD_HIGH_MINI-1);
           /* Lib_LcdGotoxy(0, 32/2);
            Lib_LcdPrintfCE(" 输入错误", " Input error!");
            Lib_LcdGotoxy(0, 48/2);
            Lib_LcdPrintfCE(" 请重新输入！", " Reinput PWD");*/
			Lib_LcdPrintxy(0, 8*2,0x00,"  Input error!");
			Lib_LcdPrintxy(0, 8*3,0x00,"  Reinput PWD");
            (void)Lib_KbGetCh();
            continue;
        }
        if (0 != memcmp(pbyOutPassword,abyTemp,AM_MANAGE_PWD_LEN))
        {
            Lib_LcdClrLine(32/2, LCD_HIGH_MINI-1);
            /*Lib_LcdGotoxy(0, 32/2);
            Lib_LcdPrintfCE(" 两次输入不同", " Input error!");
            Lib_LcdGotoxy(0, 48/2);
            Lib_LcdPrintfCE(" 请重新输入！", " Reinput PWD");*/
			Lib_LcdPrintxy(0, 8*2,0x00,"Input error!");
			Lib_LcdPrintxy(0, 8*3,0x00,"  Reinput PWD");
            (void)Lib_KbGetCh();
            continue;
        }
        return AM_SUCCESS;
    }
}

DWORD AM_SaveManageKey(int iManageNo, MANAGE_KEY *psManageKey)
{
    BYTE abyCrc32[4];
    int iRet;
    BYTE abyMMK1[24];
    MAN_APP_KEY g_sMaKey;
    
    if (iManageNo >= MANAGE_NUMBER)
    {
        return AM_MANAGE_NOT_EXIST;
    }
    (void)s_AM_ReadMaKey(&g_sMaKey);
    //memcpy(psManageKey->abyFlag, &g_wValidateFlag, 2);
    memcpy(psManageKey->abyFlag, "\x55\x55", 2);
    iRet = s_PciReadMMK(MA_MMK_INDEX, (DWORD*)abyMMK1);
    if (AM_SUCCESS != iRet)
    {
        return AM_READ_MMK_ERROR;
    }
    Lib_DES3_16(psManageKey->abyKeyData, abyMMK1, ENCRYPT);
    Lib_DES3_16(&(psManageKey->abyKeyData[8]), abyMMK1, ENCRYPT);
    Lib_DES3_16(&(psManageKey->abyKeyData[16]), abyMMK1, ENCRYPT);
    memset(abyMMK1, 0, sizeof(abyMMK1));
    QuickCrc32((BYTE*)psManageKey, sizeof(MANAGE_KEY)-4, psManageKey->abyCrc32);
    memcpy(&(g_sMaKey.asManKey[iManageNo]), psManageKey, sizeof(MANAGE_KEY));
    s_AM_WriteMaKey(&g_sMaKey);
    memset(&g_sMaKey, 0, sizeof(MAN_APP_KEY));
    return AM_SUCCESS;
}


void AM_ChangePassword(void)
{
    BYTE byRet, abyPwd[10], abyTemp[10];
    DWORD dwRet;
    int iManageNo, iErrorTimes;
    MANAGE_KEY sManageKey;

    Lib_LcdCls();
    /*Lib_LcdGotoxy(0, 0);
    Lib_LcdSetAttr(1);
    Lib_LcdPrintfCE("   管理员选择   ", " Manage select  ");
    Lib_LcdSetAttr(0);
    Lib_LcdGotoxy(0, 16/2);
    Lib_LcdPrintfCE(" 1.管理员A     ", " 1. Manage A  ");
    Lib_LcdGotoxy(0, 48/2);
    Lib_LcdPrintfCE(" 2.管理员B     ", " 2. Manage B  ");*/
	Lib_LcdPrintxy(0, 8*0,0x80,"    Manage select    ");
	Lib_LcdPrintxy(0, 8*1,0x00," 1. Manage A  ");
	Lib_LcdPrintxy(0, 8*2,0x00," 2. Manage B  ");
    while (1)
    {
        byRet = Lib_KbGetCh();
        if (KEY1 == byRet)
        {
            iManageNo = AM_MANAGE_NO1;
            break;
        }
        else if (KEY2 == byRet)
        {
            iManageNo = AM_MANAGE_NO2;
            break;
        }
        else if (KEYCANCEL == byRet)
        {
            return ;
        }
    }
    iErrorTimes = 0;
    while (1)
    {
        if (iErrorTimes >= 3)
        {
			WriteLog("Change Password FAILED!\n", 1, iManageNo);
            return ;
        }
        Lib_LcdCls();
       /* Lib_LcdGotoxy(0, 0);
        Lib_LcdSetAttr(1);
        Lib_LcdPrintfCE(" 管理员修改密码 ", "Manage changekey");
        Lib_LcdSetAttr(0);*/
		Lib_LcdPrintxy(0, 8*0,0x80,"  Manage changekey  ");
        dwRet = InputPassword(abyPwd, 4, 1);

      /*  Lib_LcdClrLine(20/2, LCD_HIGH_MINI-1);
        Lib_LcdGotoxy(0, 32/2);*/
		 Lib_LcdClrLine(8*1, LCD_HIGH_MINI-1);
        if (AM_USER_PRESS_CANCEL == dwRet)
        {
            //Lib_LcdPrintfCE("  用户取消输入  ", "  User cancel   ");
			Lib_LcdPrintxy(0, 8*2,0x00, "  User cancel   ");
            Lib_KbGetCh();
 			WriteLog("Change Password FAILED!\n", 1, iManageNo);
            return ;
        }
		else if (AM_INPUT_TIME_OUT == dwRet)
		{
			//Lib_LcdPrintfCE("  用户输入超时  ", "  Input TimeOut ");
			Lib_LcdPrintxy(0, 8*2,0x00,  "  Input TimeOut ");
            Lib_KbGetCh();
 			WriteLog("Change Password FAILED!\n", 1, iManageNo);
            return ; 
		}
        else if (AM_USER_INPUT_ERROR == dwRet)
        {
            //Lib_LcdPrintfCE("    输入错误    ", "  Input error   ");
			Lib_LcdPrintxy(0, 8*2,0x00, "  Input error   ");
            Lib_KbGetCh();
			WriteLog("Change Password FAILED!\n", 1, iManageNo);
            return ;
        }
        dwRet = AM_ReadManageKey(iManageNo, &sManageKey);
        memcpy(abyTemp, sManageKey.abyKeyData, 8);
        if (AM_MA_KEY_NOT_EXIST == dwRet)
        {
            memset(abyTemp, 0, 8);
        }
        if (0 == memcmp(abyPwd, abyTemp, 8))
        {
            break;
        }
        //Lib_LcdPrintfCE("    密码错误    ", "  Pwd error    ");
		Lib_LcdPrintxy(0, 8*2,0x00, "  Pwd error    ");
        Lib_KbGetCh();
        iErrorTimes++;
    }
  /*  Lib_LcdClrLine(20/2, LCD_HIGH_MINI-1);
    Lib_LcdGotoxy(0, 32/2);*/
	Lib_LcdClrLine(8*1, LCD_HIGH_MINI-1);
    dwRet = AM_InputNewPassword(abyPwd, 1);
    //Lib_LcdClrLine(20/2, LCD_HIGH_MINI-1);
    //Lib_LcdGotoxy(0, 32/2);
	Lib_LcdClrLine(8*1, LCD_HIGH_MINI-1);
    if (AM_USER_PRESS_CANCEL == dwRet)
    {
        //Lib_LcdPrintfCE("    用户取消    ", "   User cancel  ");
		Lib_LcdPrintxy(0, 8*2,0x00, "   User cancel  ");
        Lib_KbGetCh();
		WriteLog("Change Password FAILED!\n", 1, iManageNo);
        return ;
    }
    else if (AM_SUCCESS != dwRet)
    {
		WriteLog("Change Password FAILED!\n", 1, iManageNo);
        return ;
    }
    memcpy(sManageKey.abyKeyData, abyPwd, 8);
    sManageKey.byKeyLen = 8;
    dwRet = AM_SaveManageKey(iManageNo, &sManageKey);
    if (AM_SUCCESS != dwRet)
    {
        //Lib_LcdPrintfCE("    保存失败    ", "   Save failed   ");
		Lib_LcdPrintxy(0, 8*2,0x00, "   Save failed   ");
		WriteLog("Change Password FAILED!\n", 1, iManageNo);
    }
    else
    {
        //Lib_LcdPrintfCE("    保存成功    ", "   Save success  ");
		Lib_LcdPrintxy(0, 8*2,0x00,  "   Save success  ");
		WriteLog("Change Password OK!\n", 1, iManageNo);
    }
    Lib_KbGetCh();
}

void s_SaveGrayValue(BYTE level)
{
  BYTE buf[2]={0};
  buf[0] = 0xa5;
  buf[1] = level;
  sys_flash_syspara_write(LCD_GRAY_M,buf,2);
}

BYTE s_ReadGrayValue(void)
{
	BYTE *startAddr;
	BYTE buf[2]={0};
	BYTE level;
#if 0  //tmp disable
	startAddr = (BYTE *)(0xA1028000); 
	hal_flash_read(buf, startAddr, 2);
	if (buf[0] != 0xa5) {
		return 0xff;
	}
#endif
        sys_flash_syspara_read(LCD_GRAY_M,buf,2);
        
        
        //test
        //buf[1] = 10;
#ifdef ST7567_M
    buf[1] = 19;
#else        
    buf[1] = 19;
#endif        
	level = buf[1];
    if (level < GRAY_MIN_LEVEL)
    {
        level = GRAY_MIN_LEVEL;
    }
    else if (level > GRAY_MAX_LEVEL)
    {
        level = GRAY_MAX_LEVEL;
    }

	return level;
}

//void AdjustLcdGrayValue()
int AdjustLcdGrayValue()
{
    BYTE byVal, byRet;
    int y;

    (void)Lib_LcdSetFont(8, 16, 0);
    Lib_LcdCls();
    Lib_KbFlush();

     byVal = s_ReadGrayValue();
    if (byVal == 0xff)
		byVal = DEFAULT_GRAY_LEVEL;
	
    Lib_LcdCls();
    /*Lib_LcdPrintxyCE(0, 0, 0x81, "  设置显示灰度  " , "  SET LCD GRAY  ");
    Lib_LcdPrintxyExtCE(0, 16/2, 0x01, "   灰度（%02d）   ", "    Gray(%02d)    ", byVal);
    Lib_LcdPrintxyCE(0, 48/2, 0x01, "按'0'恢复默认值" , "Press 0 default");*/
	Lib_LcdPrintxy(0,8*0,0x80,"    SET LCD GRAY    " );
	Lib_LcdPrintxy(0,8*1,0x00,"     Gray(%02d)    ", byVal );
	Lib_LcdPrintxy(0,8*3,0x00,"Press 0 default" );
    /*for (y = 32/2; y < 48/2; y++)  //25   21
    {
        
		Lib_LcdDrawBox(16, y/2, byVal*2, y); 
    }
    Lib_LcdDrawBox(0,15,127,63/2);*/
    while (1)
    {
        byRet = Lib_KbGetCh();
        if ((byRet==KEYENTER) || (byRet==KEYMENU))
        {
        	s_SaveGrayValue(byVal);
            return 0;
        }
        if (byRet == KEYCANCEL)
        {
            LoadApp();
            return 0xff;
        }

