wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
        //　调整LCD的对比度
        if (byRet == KEYUP)
        {
            if (byVal < GRAY_MAX_LEVEL)
            {
                byVal++;
            }
        }
        else if (byRet == KEYDOWN)
        {
            if (byVal > GRAY_MIN_LEVEL)
            {
                byVal--;
            }
        }
        else if (byRet == KEY0)
        {
            byVal = DEFAULT_GRAY_LEVEL;
        }
        else
        {
            continue;
        } 
        Lib_LcdSetGray(byVal);
       /* (void)Lib_LcdPrintxyExtCE(0, 16/2, 0x01, "   灰度（%02d）", "    Gray(%02d)", byVal);*/
		Lib_LcdPrintxy(0,8*1,0x00,"     Gray(%02d)    ", byVal );
        /*Lib_LcdClrLine(32/2, 47/2);
        for (y = 32/2; y < 48/2; y++)  
        { 
			Lib_LcdDrawBox(16, y/2, byVal*2, y); 
        }
        Lib_LcdDrawBox(0,15,127,63/2);*/
    }
}

void SPF_CheckApp(void)
{
  
}

void SendLogStart()
{
  
#if 0  
    int fp;
    int iFileSize;
    BYTE byRet;
    BYTE abyRecvBuff[2100];
    BYTE abySendBuff[2100];
    WORD wRecvLen;
    DWORD dwOffset;
    int iRet;

    Lib_LcdCls();
    //Lib_LcdPrintxyCE(0, 0, 0x01, "上传日志", "Send Log file");
	Lib_LcdPrintxy(0,8*0,0x80,"   Send  Log  file   ");

    iFileSize = Lib_FileSize(OPERATE_LOG_FILE_NAME);
    if (iFileSize <= 0)
    {
       /* Lib_LcdPrintxyCE(0, 16/2, 0x01, "日志文件不存在", "No log file");*/
		Lib_LcdPrintxy(0,8*1,0x00, "No log file");
        (void)Lib_KbGetCh();
        return ;
    }

    fp = Lib_FileOpen(OPERATE_LOG_FILE_NAME, O_RDWR);
    if (fp < 0)
    {
        //Lib_LcdPrintxyCE(0, 16/2, 0x01, "打开日志文件失败", "Open log failed");
		Lib_LcdPrintxy(0,8*1,0x00, "Open log failed");
        (void)Lib_KbGetCh();
        return ;
    }
    g_iComBauds = 115200;
    iRet = Down_Open();
//    iRet = Lib_ComOpen(LOAD_COM, "115200,8,n,1");
    if (0 != iRet)
    {
        Lib_FileClose(fp);
        //Lib_LcdPrintxyCE(0, 16/2, 0x01, "打开串口失败", "Open COM failed");
		Lib_LcdPrintxy(0,8*1,0x00, "Open COM failed");
        (void)Lib_KbGetCh();
        return ;
    }
    (void)Lib_FileSeek(fp, 0, FILE_SEEK_SET);
    //Lib_LcdPrintxyCE(0, 0, 0x01, "日志上传文件", "Send Log file");
	Lib_LcdPrintxy(0,8*0,0x80, "  Send  Log  file    ");
    iRet = SendLogShackhand();
    if (0 != iRet)
    {
        /*Lib_LcdClrLine(2*8/2, 8*8/2);
        Lib_LcdPrintxyCE(0, 4*8/2, 0x01, "用户取消上传日志", "User cancelled!");*/
		Lib_LcdClrLine(8*1, LCD_HIGH_MINI-1);
		Lib_LcdPrintxy(0,8*2,0x00, "User cancelled!");
        Lib_FileClose(fp);
        Down_Close();
//        (void)Lib_ComClose(LOAD_COM);
        (void)Lib_KbGetCh();
        return ;
    }
  /*  Lib_LcdClrLine(2*8/2, 8*8/2);
    Lib_LcdPrintxyCE(0, 4*8/2, 0x01, "开始下载..", "Download file...");*/
	Lib_LcdClrLine(8*1, LCD_HIGH_MINI-1);
	Lib_LcdPrintxy(0,8*2,0x00, "Download file...");

    while (1)
    {
        iRet = LrcRecvPacket(abyRecvBuff, &wRecvLen, 2000);
        if (0 == iRet)
        {
            switch (abyRecvBuff[1])
            {
            case CMD_GET_LOG_FILE_LENGTH:
                abySendBuff[0] = (BYTE)((iFileSize/65536)/256);
                abySendBuff[1] = (BYTE)((iFileSize/65536)%256);
                abySendBuff[2] = (BYTE)((iFileSize%65536)/256);
                abySendBuff[3] = (BYTE)(iFileSize%256);
                LrcSendPacket(abySendBuff, 4, CMD_GET_LOG_FILE_LENGTH);
                break;
            case CMD_GET_LOG_DATA:
                dwOffset = (abyRecvBuff[4]*256+abyRecvBuff[5])*65536
                    + abyRecvBuff[6]*256 + abyRecvBuff[7];
                if (dwOffset >= (DWORD)iFileSize)
                {
                    LrcSendPacket(abySendBuff, 0, CMD_GET_LOG_DATA);
                }
                else
                {
                    (void)Lib_FileSeek(fp, (long)dwOffset, FILE_SEEK_SET);
                    iRet = Lib_FileRead(fp, &abySendBuff[1], 1000);
                    if (iRet <= 0)
                    {
                        abySendBuff[0] = 1;
                        LrcSendPacket(abySendBuff, 1, CMD_GET_LOG_DATA);
                    }
                    else
                    {
                        abySendBuff[0] = 0;
                        LrcSendPacket(abySendBuff, (WORD)(iRet+1), CMD_GET_LOG_DATA);
                    }
                }
                break;
            case CMD_DELETE_LOG_FILE:
                Lib_FileClose(fp);
                iRet = Lib_FileRemove(OPERATE_LOG_FILE_NAME);
                if (0 == iRet)
                {
                    abySendBuff[0] = 0;
                }
                else
                {
                    abySendBuff[0] = 1;
                }
                LrcSendPacket(abySendBuff, 1, CMD_DELETE_LOG_FILE);
                break;
            case SEND_FINISH:
//                (void)Lib_ComClose(LOAD_COM);
               /* Lib_LcdClrLine(2*8/2, 8*8/2);
                Lib_LcdPrintxyCE(0, 4*8/2, 0x01, "上传日志成功!", "Send Logfile OK!");*/
				Lib_LcdClrLine(8*1, LCD_HIGH_MINI-1);
				Lib_LcdPrintxy(0,8*2,0x00, "Send Logfile OK!");
                (void)Lib_KbGetCh();
                return ;
            default:
                break;
            }
        }
    }
#endif
    
}

int s_AppPciInit(void)
{
    int i;
    uchar ch;
    int ret;
    DWORD dret;
    

    if((SPF_GetAppStatus(0)&0x04)==0)//未运行
    {
      s_PciClearAppKey(0);
    }
    
    (void)s_PciInit(); 
    s_InitVos();

    (void)s_SystemTestSelf();
    
    g_byCurAppNum = 0xff; 
    
 
	//s_PciViewAuthKey(); 
    AM_CheckPedLock();

    
#if 0
    Lib_LcdCls();
    /*Lib_LcdSetFont(8, 16, 0);
    Lib_LcdGotoxy(0, 8*1);*/
    //Lib_LcdPrintfCE("按\"确认\"键查询", "Press\"ENTER\"key show ver.");
    Lib_LcdPrintxy(0, 8*1, 0, "Press\"ENTER\"key show ver.");
    //Lib_LcdGotoxy(0, 8*2);
    //Lib_LcdPrintfCE("按\"功能\"键设置", "Press \"F1\" key into set");
	 Lib_LcdPrintxy(0,8*2,0, "Press \"F1\" key into set");
#endif 
         
    i = 100;
    ch = 0;
    while (i > 0)
    {
        if (!Lib_KbCheck())
        {
            ch = Lib_KbGetCh();
            if (KEYENTER == ch)
            {
                Lib_KbFlush();
                if(ShowVosVersion()==0xff)
                  return 0xff;
            }
            else if (KEYF1 == ch)
            {
                break;
            }
        }
        Lib_DelayMs(20);
        i--;
    }
    
    
    Lib_LcdCls();
    Lib_LcdSetFont(8, 16, 0);
    SPF_CheckApp();
    
    
    
    if (i <= 0)
    {
        if (0 == CheckVOSSignKey())
        {
            LoadApp();
            return 0xff;
        }
    }

Loop_ReLogin:    
	s_SetTimer(3,90000);//15 minutes
        
    while (1)
    {
        if (0 == ManageLogin())
        {
	    g_iActionLimits=0;
            break;
        }
        if (0 == CheckVOSSignKey())
        {
            LoadApp();
            return 0xff;
        }
    }

    
    while (1)
    {
        Lib_KbFlush();
	Lib_ComReset(LOAD_COM);//12/12/12 disble
        
