wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
	//对进入系统菜单后的所有操作都视为敏感服务，对所有敏感服务的操作进行10次的限制，超过10次则退出系统菜单
	if (g_iActionLimits >= 10)
	{
            if (0 == CheckVOSSignKey())
            {
                LoadApp();
                return 0xff;
            }
            goto Loop_ReLogin;               
	}
        
        ret = ShowSystemMenu();


        if(ret == KM_WAIT_TIMEOUT_ERROR)
        {
            if (0 == CheckVOSSignKey())
            {
                LoadApp();
                return 0xff;
            }
            goto Loop_ReLogin;               
        } 
        switch (ret)
        {
          
        case 1:
            dret=KM_LoadKey();
//            //if(dret == KM_WAIT_TIMEOUT_ERROR || dret == KM_SUCCESS)
//            //{
//			//下载密钥成功或失败都退回应用，每次只限一次下载密钥操作
//				if (0 == CheckVOSSignKey())
//				{
//					LoadApp();
//				}
//                goto Loop_ReLogin;               
//            //} 
	  g_iActionLimits++;
            break;
            
#if 0            
        case 2:
            (void)SystemTest();
	    g_iActionLimits++;
            break;
#endif            
        case 3:
            AM_ChangePassword();
	    g_iActionLimits++;
            break;
#if 0            
        case 4:
            s_SystemTestSelf();
	    g_iActionLimits++;
            break;
#endif            
	//case 5:
        case 2:  
	    AdjustLcdGrayValue();
	    g_iActionLimits++;
	    break;
	case 6:
	    SendLogStart();
	    g_iActionLimits++;
	    break;
        case 0x10:
            if(ShowVosVersion()==0xff)
              return 0xff;
            break;
        case 0x11:
            while (1)
            {
                if (0 == CheckVOSSignKey())
                {
                    LoadApp();
                    return 0xff;
                }
                if (0 == ManageLogin())
                {
					g_iActionLimits=0;
                    break;
                }
            }
            break;
//        default:  // 1和0xff
#if 0            
	case 0xff:
            MyLocalDownload();
            if (115200 != g_iComBauds)
            {
                g_iComBauds = 115200;
                (void)Down_Open();
            }
            SPF_CheckApp();
	    g_iActionLimits++;
            break;
#endif            
        }
    }    
  
}

void _SetLock_EraseApp()
{
#if 0
        unsigned char bVal,sBuf[2048]={0};
        RM_flash_erase_page(0);
        RM_flash_erase_page(1);
        RM_flash_erase_page(2);
        RM_flash_erase_page(3);
        RM_flash_erase_page(4);
        RM_flash_erase_page(5);
        RM_flash_erase_page(6);
        memset(sBuf,0,sizeof(sBuf));
        flash_write_operate(0x08000000+APPLICATIONADDRESS,(unsigned short*)sBuf,2048);
#endif
       s_SetLockState(1); 
  
}

/****************************************************************************
  函数名     :
  描述       :
  输入参数   :
  输出参数   :
  返回值     :
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/
int  Lib_AppInit(void)
{
    //initial_system();
  int ret,fd;
  static unsigned char bRun=0;
  unsigned char sBuf[10]={0};
  
  //第二次调用
  if(bRun++>0)
  {
    bRun = 1;
    return 0xff;
  }    
  
//#if 0  
    initial_system();
//#endif    
//trace_debug_printf(" initial_system end");
  

  
    s_AppPciInit();
//trace_debug_printf(" s_AppPciInit end");
   // Lib_ComOpen(0,"115200,8,N,1");



    s_PciClearAuthFlag();
    
  fd = SPF_GetAppRunStatus(g_byCurAppNum);
  if (fd < 0)
    return 0;

  if(fd==0)//未运行过
  {
      
    SPF_SetAppRunStatus(g_byCurAppNum, 1);
    
      WriteToBackupReg(5,0xA5A5); //13/04/20
    
  }
  
  s_GetLockStateBuf(sBuf);
  //test
  //Lib_LcdPrintxy(0, 0*8, 0x00, "Get[%s]",sBuf);
  //Lib_DelayMs(3000);
    
  if(memcmp(sBuf,"UNLOCKER",8)==0) //system unlock
  {
      WriteToBackupReg(5,0xA5A5); //13/04/20
      s_SetLockState(0);
  }  
      //13/04/20
//#if 0 //move to boot
#if 1   //chang by wf
      if(CheckBackupReg(5,0xA5A5)) //开盖触发
      {
	//Lib_LcdCls();
	Lib_LcdPrintxy(0, 2*8, 0x00, "DEVICE LOCKED!!!");
        //SPF_SetAppRunStatus(g_byCurAppNum, 1);//下次为第一次
        _SetLock_EraseApp();
        
        TAMPERClear();  //13/05/25
        
        WriteToBackupReg(5,0xA5A5); //13/04/20
        SPF_SetAppDownUnLockStatus(0);
        for(;;);
      }
#endif
//#endif
  
  return 0;
}

void   Lib_DelayMs(int ms)
{
    if(ms<=0)
      return;
    delay_ms(ms);
}

//#if 0 //gplian
#ifndef AS3911_M
int  Lib_PiccOpen(void)
{
  return PiccOpen();
}

void Lib_PiccHalt(void)
{
}

int  Lib_PiccClose(void)
{
  PiccClose();
  return 0;  
}

int  Lib_PiccRemove(void)
{
  unsigned char bRet;
  bRet= PiccRemove('R',0);
  if(bRet==2) //RET_RF_ERR_NO_OPEN
    return PICC_NotOpen;
  else if(bRet==6)
    return PICC_HaveCard;
  return bRet;
  
}
#if 0
int   Lib_IccCheck(uchar slot)
{
  return 0;
}
#endif

int  Lib_PiccCheck(uchar mode,uchar *CardType,uchar *SerialNo)
{
  unsigned char Other[50];
  unsigned char bRet;
  //13/01/16 for app
  if(mode==3)
    mode = 0;
    //13/08/09
  PN512_s_RFResetCarrier();
  
  //bRet = PiccDetect(mode,CardType,SerialNo,NULL,Other);
  bRet = PiccDetect(0,CardType,SerialNo,NULL,Other);//13/02/19 the same as before
  if(bRet==2)
    return PICC_NotOpen;
  else if(bRet==1)//RET_RF_ERR_PARAM
    return PICC_ParameterErr;
  else if(bRet==4)//multi card 13/08/02
    return PICC_Collision;
  return bRet;
  //return   PiccDetect(0,CardType,SerialNo,NULL,Other);
  
}

int  Lib_PiccReset(void)
{
  //PN512_s_RFResetCarrier();
  unsigned char bRet;
  bRet = PiccReset();
  if(bRet==1)
    return PICC_NotOpen;
  else if(bRet==2)
    return PICC_CardTyepErr;
  return bRet;
}

int  Lib_PiccCommand(APDU_SEND *ApduSend, APDU_RESP *ApduResp)
{
  unsigned char bRet;
  bRet = PiccIsoCommand(0,ApduSend,ApduResp);
  if(bRet==2)
    return PICC_NotOpen;
  return bRet;
  
}
#endif

//#endif


/*********************************************************************
 NAME: uchar dat_bytetobcd(uchar bchar)
 FUNC: convert one uchar to bcd(bchar<100)
 IN  : bchar:to be converted
 OUT : 
 RTRN: the result converted
 NOTE:for example: convert 12 ->  0x18 ( because 0x12=18)
*********************************************************************/
static uchar dat_bytetobcd(uchar bchar)
{
	unsigned char bcd_code, btmp;

	btmp = bchar/10;
	bcd_code = btmp*16;
	bcd_code += bchar-btmp*10;
	return(bcd_code);
}

int    Lib_GetDateTime(uchar *datetime)
{
  
  struct tm tDate;
  int nSec,nHour,nHourOth;
  uchar tm_hour,tm_min,tm_sec;
  uchar sBuf[10];
  //gettime(&tDate);
  
