wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
  nSec = RTC_GetCounter();
  nHour = (nSec)/3600;
  nHourOth = (nSec)%3600;
    
  tDate.tm_hour = (nHour);
  tDate.tm_min =  (nHourOth/60);
  tDate.tm_sec =  (nHourOth%60);
  
  DateGetYYMMDD(sBuf);
  tDate.tm_year = sBuf[0]  ;
  tDate.tm_mon = sBuf[1];
  tDate.tm_mday = sBuf[2];
  
  datetime[0] = dat_bytetobcd(tDate.tm_year);
  datetime[1] = dat_bytetobcd(tDate.tm_mon);
  datetime[2] = dat_bytetobcd(tDate.tm_mday);
  datetime[3] = dat_bytetobcd(tDate.tm_hour);
  datetime[4] = dat_bytetobcd(tDate.tm_min);
  datetime[5] = dat_bytetobcd(tDate.tm_sec);
   
  CheckTime(datetime,datetime+6);
  
  return 0;
}

int CheckBCD(unsigned char str)
{
    unsigned char ch;
    ch=str & 0x0f;
    if(ch>=0x0a) return TIME_FORMAT_ERR;
    ch=str & 0xf0;
    if(ch>=0xa0) return TIME_FORMAT_ERR;
    return 0;
}

int CheckTime(uchar *str,uchar *week)
{
    long days;
    uchar ch,day,ucBuf[12];
    int i,j,k;
    uchar ret=0;

    if(CheckBCD(str[0])) return TIME_YEAR_ERR;         //ret |= 0x01;
    if(CheckBCD(str[1])) return TIME_MONTH_ERR;        //ret |= 0x02;
    if(CheckBCD(str[2])) return TIME_DAY_ERR;          //ret |= 0x04;
    if(CheckBCD(str[3])) return TIME_HOUR_ERR;         //ret |= 0x08;
    if(CheckBCD(str[4])) return TIME_MINUTE_ERR;       //ret |= 0x10;
    if(CheckBCD(str[5])) return TIME_SECOND_ERR;       //ret |= 0x20;

    if(str[1]==0 || str[1]>0x12) return TIME_MONTH_ERR; //ret |= 0x02;
    if(str[2]==0 || str[2]>0x31) return TIME_DAY_ERR;  //ret |= 0x04;
    if(str[3]>0x23) return TIME_HOUR_ERR;              //ret |= 0x08;
    if(str[4]>0x59) return TIME_MINUTE_ERR;            //ret |= 0x10;
    if(str[5]>0x59) return TIME_SECOND_ERR;            //ret |= 0x20;

    i=(str[0]>>4)*10+(str[0] & 0x0f);
    if(i<50) i+=2000;
    else i+=1900;
    memcpy(ucBuf,"\x1f\x1c\x1f\x1e\x1f\x1e\x1f\x1f\x1e\x1f\x1e\x1f",12);
    if(i%4==0) ucBuf[1]=0x1d;
    k=(str[1]>>4)*10+(str[1] & 0x0f)-1;
    day=(str[2]>>4)*10+(str[2] & 0x0f);
    if(day>ucBuf[k]) return TIME_DAY_ERR; //ret |= 0x04;

    days=0;
    for(j=1950;j<i;j++){
        if(j%4==0) days+=366;
        else days+=365;
    }

    for(i=0;i<k;i++) days+=ucBuf[i];
        days+=(day+5);
    i=(int)(days%7+1);
    *week=(uchar)i;

    return ret;
}

int    Lib_SetDateTime(uchar *datetime)
{
  struct tm tDate;
  int iRet;
  
     uchar BcdTime[8];
     
#if 0     
//test
Lib_LcdPrintxy(0,0,0," RCC_FLAG_PORRST[%d]",RCC_GetFlagStatus(RCC_FLAG_PORRST));
Lib_KbGetCh();
Lib_LcdPrintxy(0,0,0," RCC_FLAG_LPWRRST[%d]",RCC_GetFlagStatus(RCC_FLAG_LPWRRST));
Lib_KbGetCh();
#endif

     memset(BcdTime,0,8);
     memcpy(BcdTime,datetime,6);
     BcdTime[6]=0x00;
     
//#if 0
     iRet=CheckTime(datetime,BcdTime+6);
     if(iRet) return iRet;
//#endif  
  tDate.tm_year = (datetime[0]>>4)*10+(datetime[0]&0x0f);
  tDate.tm_mon = (datetime[1]>>4)*10+(datetime[1]&0x0f);
  tDate.tm_mday = (datetime[2]>>4)*10+(datetime[2]&0x0f);
  tDate.tm_hour = (datetime[3]>>4)*10+(datetime[3]&0x0f);
  tDate.tm_min = (datetime[4]>>4)*10+(datetime[4]&0x0f);
  tDate.tm_sec = (datetime[5]>>4)*10+(datetime[5]&0x0f);
  
  settime(&tDate);  
  
  return 0;
}

void Lib_LedInit(void)
{
  
}

void Lib_LedOff(WORD mask)
{
  //if(mask==1)
  if(mask&1)
  {
    LED_Show(1,0);
  }
  //else if(mask==2)
  if(mask&2)
    LED_Show(2,0);
  //else if(mask==4)
#if 0
  if(mask&4)
    LED_Show(3,0);
  //else if(mask==8)
  if(mask&8)
    LED_Show(4,0);
#endif
  if(mask&4)
    LED_Show(4,0);
  //else if(mask==8)
  if(mask&8)
    LED_Show(3,0);
  
}

void Lib_LedOn(WORD mask)
{
  //if(mask==1)
  if(mask&1)
  {
    LED_Show(1,1);
  }
  //else if(mask==2)
  if(mask&2)
    LED_Show(2,1);
  //else if(mask==4)
#if 0
  if(mask&4)
    LED_Show(3,1);
  //else if(mask==8)
  if(mask&8)
    LED_Show(4,1);
#endif
  if(mask&4)
    LED_Show(4,1);
  //else if(mask==8)
  if(mask&8)
    LED_Show(3,1);
  
}

#if 0

int   Lib_IccOpen(uchar slot,uchar VCC_Mode,uchar *ATR)
{
  SC_ADPU_Commands SC_ADPU;
  SC_ADPU_Responce SC_Responce;
  extern unsigned char SC_ATR_Table[40];
  unsigned long nTime;
  //test
  uchar i;
  //add 12/11/15
  SC_Init();
  
  SelectSlot(slot-1);
#if 0  
  //test
  SC_Init();
  Lib_LcdPrintxy(0, 0, 0x00, "111");		
  for(;;);
#endif  
  SC_State SCState = SC_POWER_OFF;
  while(1)
  {
    
    //add 12/09/28
    /* Smartcard detected */
    //CardInserted = 1;
    /* Power ON the card */
    SC_PowerCmd(ENABLE);
    /* Reset the card */
    SC_Reset(Bit_RESET);

    /* Wait A2R --------------------------------------------------------------*/
    SCState = SC_POWER_ON;

    SC_ADPU.Header.CLA = 0x00;
    SC_ADPU.Header.INS = SC_GET_A2R;
    SC_ADPU.Header.P1 = 0x00;
    SC_ADPU.Header.P2 = 0x00;
    SC_ADPU.Body.LC = 0x00;
    nTime = 0;
    while(SCState != SC_ACTIVE_ON_T0) 
    {
      
      SC_Handler(&SCState, &SC_ADPU, &SC_Responce);
      if(++nTime==0xffff)
      {
        return 1;
        break;
      }
    }
    
#if 0        
    /* Disable the Smartcard interface */
    SCState = SC_POWER_OFF;
    SC_Handler(&SCState, &SC_ADPU, &SC_Responce);
    //CardInserted = 0;    
#endif   
    memcpy(ATR,SC_ATR_Table,40);
#if 0    
    //test
    trace_debug_printf("ATR:");
    for(i=0;i<40;i++)
      trace_debug_printf("%02x ",ATR[i]);
#endif                       
    return 0;
  }  
}

int   Lib_IccClose(uchar slot)
{
  SC_ADPU_Commands SC_ADPU;
  SC_ADPU_Responce SC_Responce;
  SC_State SCState;
  
    /* Disable the Smartcard interface */
    SCState = SC_POWER_OFF;
    SC_Handler(&SCState, &SC_ADPU, &SC_Responce);
    return 0;  
}

//#endif

int   Lib_IccCommand(uchar slot,APDU_SEND * ApduSend,APDU_RESP * ApduResp)
{
//#if 0  
  SC_ADPU_Commands SC_ADPU;
  SC_ADPU_Responce SC_Responce;
  unsigned char i;
  
  SC_State SCState=SC_ACTIVE_ON_T0;
  
    /* Select MF -------------------------------------------------------------*/
    SC_ADPU.Header.CLA = ApduSend->Command[0];
    SC_ADPU.Header.INS = ApduSend->Command[1];
    SC_ADPU.Header.P1 = ApduSend->Command[2];
    SC_ADPU.Header.P2 = ApduSend->Command[3];
    SC_ADPU.Body.LC = ApduSend->Lc;
    
    memcpy(SC_ADPU.Body.Data,ApduSend->DataIn,SC_ADPU.Body.LC );
    
    i = SC_ADPU.Body.LC;
#if 0
    for(i = 0; i < SC_ADPU.Body.LC; i++)
    {
      SC_ADPU.Body.Data[i] = MasterRoot[i];
    }
#endif
    
    
    while(i < LC_MAX) 
    {    
      SC_ADPU.Body.Data[i++] = 0;
    }
    
