wlbxcj/STM32P10/3911版/src/driver/dll/dll.c
    SC_ADPU.Body.LE = 0;

    SC_Handler(&SCState, &SC_ADPU, &SC_Responce);
    
    //test
    trace_debug_printf("SW1[%02x]SW[%02x]\n",SC_Responce.SW1,SC_Responce.SW2);
    
    /* Get Response on MF ----------------------------------------------------*/
    if( (SC_Responce.SW1 == SC_DF_SELECTED) || (SC_Responce.SW1 ==0x61) )
    {
      SC_ADPU.Header.CLA = 0;
      SC_ADPU.Header.INS = SC_GET_RESPONCE;
      SC_ADPU.Header.P1 = 0x00;
      SC_ADPU.Header.P2 = 0x00;
      SC_ADPU.Body.LC = 0x00;
      SC_ADPU.Body.LE = SC_Responce.SW2;

      SC_Handler(&SCState, &SC_ADPU, &SC_Responce);
    }
    
    ApduResp->SWA = SC_Responce.SW1;
    ApduResp->SWB = SC_Responce.SW2;
    
    //test
    trace_debug_printf("22SW1[%02x]SW[%02x]\n",SC_Responce.SW1,SC_Responce.SW2);
#if 0    
    for(i=0;i<SC_ADPU.Body.LE;i++)
      trace_debug_printf("%02x ",SC_Responce.Data[i]);
#endif    
    memcpy(ApduResp->DataOut,SC_Responce.Data,SC_ADPU.Body.LE);
    ApduResp->LenOut = SC_ADPU.Body.LE;
//#endif
    
    return 0;
}

#endif

void Lib_GetRand(uchar *out_rand ,uchar  out_len)
{
  unsigned char i,bCount;
  union 
  {
    unsigned  int nVal;
    unsigned char sDat[4];
  }uRand;
  bCount =   out_len/4;
  if(out_len%4)
    bCount++;
  for(i=0;i<bCount;i++)
  {
	srand(RTC_GetCounter());
        uRand.nVal= rand();	
        memcpy(&out_rand[i*4],(unsigned char*)uRand.sDat,4);    
  }
}

/****************************************************************************
  函数名     :
  描述       :
  输入参数   :
  输出参数   :
  返回值     :
  修改历史   :
      修改人     修改时间    修改版本号   修改原因
  1、
****************************************************************************/
//int Lib_ReadVerInfo(uchar *VerInfo, uchar *DllInfo)
int Lib_ReadVerInfo(uchar *VerInfo)
{

    VerInfo[0]=1;				//BOOT软件主版本
    VerInfo[1]=0;				//BOOT软件次版本
//    VerInfo[2]=k_UseAreaCode;					//BOOT区域版本
#ifdef FIRMWARE_VERSION
	VerInfo[2]=FIRMWARE_MAJOR_VERSION;		//VOS主版本
	VerInfo[3]=FIRMWARE_MINOR_VERSION; 		//VOS次版本
	VerInfo[4]=FIRMWARE_MODIFIED_VERSION; 	//VOS修正版版本
#else
    VerInfo[2]=0;		
    VerInfo[3]=0;		
	VerInfo[4]=0;
#endif
    VerInfo[5]=0;							//DLL库主版本
    VerInfo[6]=0;							//DLL库次版本
    VerInfo[7]=0;
  
  
  
#if 0  
    VerInfo[0]=k_BiosVerMajor;				//BOOT软件主版本
    VerInfo[1]=k_BiosVerMinor;				//BOOT软件次版本
//    VerInfo[2]=k_UseAreaCode;					//BOOT区域版本
#ifdef FIRMWARE_VERSION
	VerInfo[2]=FIRMWARE_MAJOR_VERSION;		//VOS主版本
	VerInfo[3]=FIRMWARE_MINOR_VERSION; 		//VOS次版本
	VerInfo[4]=FIRMWARE_MODIFIED_VERSION; 	//VOS修正版版本
#else
    VerInfo[2]=0;		
    VerInfo[3]=0;		
	VerInfo[4]=0;
#endif
    VerInfo[5]=DllInfo[0];							//DLL库主版本
    VerInfo[6]=DllInfo[1];							//DLL库次版本
    VerInfo[7]=0;
    //VerInfo[8]=0;
#endif
    
    return 0;
}

int Lib_PiccGetPara(uchar *sFlag)
{
  int nRet;
  uchar sBuf[10]={0};
  nRet = sys_flash_syspara_read(PICC_SETPARA,sBuf,1);
  
    trace_debug_printf("read[%02x]\n",sBuf[0]);

  memcpy(sFlag,sBuf,1);
  
  return nRet;
  
}

  /*
          A            B
  bFlag:xxx1-  0cm      xxx1- 0cm
        x1xx-  3cm      x1xx- 3cm

        xx1x-  other    xx1x-  other
       0xf0 -正常     0x0f-正常
  */

int Lib_PiccSetPara( uchar bFlag)
{
  uchar sBuf[10],bAFlag,bBFlag;
  
  //bAFlag = sFlag[0];
  //bBFlag = sFlag[1];
  
#if 0
  if(!( (bFlag==0) &&  (bFlag==1) && (bFlag==2) && (bFlag==3) && (bFlag==0xff)))
  {
    return 1;
  }
  
#endif
  sBuf[0] = bFlag;
  sys_flash_syspara_write(PICC_SETPARA,sBuf,1);
  
  _glbPiccSetPara = bFlag;
  
  trace_debug_printf("write[%02x]\n",_glbPiccSetPara);
  
  return 0;
}


/*==============================================================
  函数功能: DES(3DES)计算
  mackey_n  计算DES的密钥(DES密钥区)
  datain    输入数据
  macout    输出数据
  mode      非零：DES加密   0x00： DES解密   
  keytype   低4位：0x00：DES, 0x01：双倍长DES密钥，0x02:三倍长DES密钥
                高4位：0x00: 用DES密钥，0x01：用主密钥， 0x02:PINKEY
  ================================================================*/
int  Pci_Des(BYTE deskey_n, BYTE *indata, BYTE *outdata, BYTE mode, BYTE keytype)
{
    uchar   deskeybuf[24],deskeylen,keymode,datain[8],keytypeL4; 
    int     iret;
    uchar bCurAppNum;//因为只有一个应用
      
    //gCurAppNum=App_Msg.Num;
    bCurAppNum = 0;
    if(deskey_n>=100)
    {
        return PCI_KeyNo_Err;
    }

    if ((indata == NULL) || (outdata == NULL))
    return PCI_NoInput_Err;
    if ((keytype & 0xf0) == 0x10)
    //iret=s_ReadDesKey(gCurAppNum,MKEY_TYPE,deskey_n,&deskeylen,deskeybuf);
    iret=s_ReadDesKey(bCurAppNum,PIN_MKEY_TYPE,deskey_n,&deskeylen,deskeybuf);
    
    else if ((keytype & 0xf0) == 0x20)
    iret=s_ReadDesKey(bCurAppNum,PINKEY_TYPE,deskey_n,&deskeylen,deskeybuf);
    else 
    iret=PCI_KeyType_Err;	
    if(iret) return iret;
		
    keytypeL4=keytype & 0x0f;
		
    memset(datain,0,sizeof(datain));
    memcpy(datain,indata,8);
    
    switch(deskeylen/8)
    {
    case 0x01:
		if(keytypeL4 != 0) return PCI_KeyType_Err;
        if(mode)
        {
            DES(datain,deskeybuf,1);
        }
        else
        {
            DES(datain,deskeybuf,0);
        }   
        
        break;
    case 0x02:
			if(keytypeL4 == 0)
			{
			if(mode) DES(datain,deskeybuf,1);
			else DES(datain,deskeybuf,0);
			}
			else if(keytypeL4 ==1)
			{
			if(mode)
			{
			DES(datain,deskeybuf,1);
			DES(datain,&deskeybuf[8],0);
			DES(datain,deskeybuf,1);
			}
			else
			{
			DES(datain,deskeybuf,0);
			DES(datain,&deskeybuf[8],1);
			DES(datain,deskeybuf,0);
			}
			}
			else return PCI_KeyType_Err;

        break;
    case 0x03:
			if(keytypeL4 == 0)
			{
			if(mode) DES(datain,deskeybuf,1);
			else DES(datain,deskeybuf,0);
			}
			else if(keytypeL4 ==1)
			{
			if(mode)
			{
			DES(datain,deskeybuf,1);
			DES(datain,&deskeybuf[8],0);
			DES(datain,deskeybuf,1);
			}
			else
			{
			DES(datain,deskeybuf,0);
			DES(datain,&deskeybuf[8],1);
			DES(datain,deskeybuf,0);
			}
			}
			else if(keytypeL4 ==2)
			{
			if(mode)
			{
			DES(datain,deskeybuf,1);
			DES(datain,&deskeybuf[8],0);
			DES(datain,&deskeybuf[16],1);
			}
			else
			{
			DES(datain,&deskeybuf[16],0);
			DES(datain,&deskeybuf[8],1);
			DES(datain,deskeybuf,0);
			}
			}
			else return PCI_KeyType_Err;
			        break;
    default: return PCI_KeyLen_Err;
    }
    
    memcpy(outdata,datain,8);
    memset(deskeybuf,0,24);
    return 0;
}

void   Lib_Reboot(void)
{
  Buzzer_Off();
  NVIC_GenerateSystemReset();
  NVIC_GenerateCoreReset();
  while(1);
}
